{
  "Artists": [
    {
      "ArtistID": "the-alan-parsons-project",
      "Name": "The Alan Parsons Project",
      "Type": "Band",
      "Origin": {
        "City": "London",
        "Region": "England",
        "Country": "United Kingdom",
        "Place": "London, England, United Kingdom"
      },
      "YearsActive": [
        "1975–1990"
      ],
      "CoreMembers": [
        {
          "Name": "Alan Parsons",
          "Roles": [
            "Engineer",
            "Producer",
            "Co-founder",
            "Occasional instrumental/backing vocal contributions"
          ],
          "Years": "1975–1990",
          "Overview": "Engineer/producer and sonic architect of the Project’s studio identity; co-wrote a number of instrumentals and shaped the overall sound through production and mixing decisions.",
          "Bio": {
            "BioID": "the-alan-parsons-project-alan-parsons",
            "ArtistID": "the-alan-parsons-project",
            "ArtistName": "The Alan Parsons Project",
            "MemberName": "Alan Parsons",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "1948-12-20",
              "City": "Willesden",
              "Region": "Middlesex",
              "Country": "United Kingdom",
              "Place": "Willesden, Middlesex, England, United Kingdom"
            },
            "Death": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": "",
              "Cause": ""
            },
            "ActiveYears": "1967–present",
            "AssociatedActs": [
              "The Alan Parsons Project"
            ],
            "KeyAlbums": [
              "Tales of Mystery and Imagination",
              "I Robot",
              "The Turn of a Friendly Card",
              "Eye in the Sky"
            ],
            "KeySongs": [
              "Sirius",
              "Eye in the Sky",
              "Time"
            ],
            "Achievements": [
              "Key engineer/producer with high-profile Abbey Road-era credits prior to forming The Alan Parsons Project.",
              "Known for a meticulous, high-clarity production style that became the Project’s defining “house sound.”"
            ],
            "ExternalLinks": {
              "OfficialSite": "https://alanparsons.com/",
              "Wikipedia": "https://en.wikipedia.org/wiki/Alan_Parsons",
              "Discogs": "https://www.discogs.com/artist/17743-Alan-Parsons"
            },
            "FullName": "Alan Parsons",
            "PrimaryInstruments": [
              "Keyboards",
              "Guitar",
              "Bass"
            ],
            "Occupations": [
              "Audio engineer",
              "Record producer",
              "Musician",
              "Songwriter",
              "Composer"
            ],
            "Genres": [
              "Progressive rock",
              "Rock",
              "Art rock"
            ],
            "FullText": "Alan Parsons (born 20 December 1948) is an English audio engineer, producer, and musician whose career grew out of the late‑1960s British studio system. He entered EMI’s Abbey Road environment as a young engineer and learned the discipline of documenting sessions, managing complex setups, and delivering repeatable results—skills that later became central to the “high-definition” sound people associate with his work.\n\nWorking in and around Abbey Road during rock’s most technically ambitious era gave Parsons a front-row seat to evolving recording practices. He absorbed the craft of microphone choice and placement, tape handling, and the art of balancing a mix so that detail and impact coexist. Those fundamentals, combined with a calm, methodical temperament, helped him earn opportunities on major projects while still early in his career.\n\nBy the early 1970s, Parsons had built visibility through high-profile engineering work and collaborations with top-tier artists. That reputation wasn’t just about technical competence; it was about taste—knowing when to keep a performance raw, when to tighten the arrangement, and how to use studio tools to create a cinematic sense of space. This mix of precision and musical judgment became his signature.\n\nIn 1975, Parsons partnered with Eric Woolfson to form The Alan Parsons Project. The premise was deliberately studio-first: rather than a touring band with a fixed lineup, the Project would revolve around Parsons’ production/engineering and Woolfson’s songwriting and concepts. The duo could then hire the exact vocalists and instrumentalists needed for each song, making the record itself the primary product rather than the live show.\n\nParsons’ role in the Project went far beyond “turning knobs.” He shaped arrangements, chose textures, and controlled the final presentation—how drums sit against synths, how backing vocals widen a chorus, and how transitions stitch a concept album into a coherent experience. His mixes tend to emphasize clarity, separation, and a refined low end, with enough dramatic staging to keep songs feeling cinematic rather than clinical.\n\nAcross the ten studio albums, Parsons also contributed musically—often on keyboards and occasionally on other instruments—while steering the Project’s overall sound. That sonic continuity is one reason the catalog feels unified even though lead singers change from track to track. A listener can move from I Robot to Eye in the Sky and still hear a consistent production language.\n\nParsons’ engineering instincts also influenced how the Project balanced progressive ambition with radio-friendly form. Many tracks are built around strong hooks and tight structures, but the production adds layers: orchestral color, stacked harmonies, and carefully designed ambience. This is the “Project” formula—pop craft presented with audiophile detail and conceptual framing.\n\nAfter the Project era, Parsons continued releasing music and touring under his own name, often presenting classic Project material in live settings with a dedicated ensemble. That later performance chapter demonstrates how studio-built songs can be adapted for stage when the right musicians and arrangements are assembled.\n\nThroughout his career, Parsons has remained associated with the idea that production is part of authorship. In the Alan Parsons Project, that idea became explicit: the sound itself—how the record feels in the room—was as central to the identity as the lyrics or melodies. For many listeners, the catalog remains a reference point for polished rock production done with musical intent."
          }
        },
        {
          "Name": "Eric Woolfson",
          "Roles": [
            "Songwriter",
            "Lyricist",
            "Co-founder",
            "Keyboardist / vocalist"
          ],
          "Years": "1975–1990",
          "Overview": "Primary songwriter/lyricist and creative director; played keyboards throughout the catalog and sang lead on key tracks while also managing the Project’s business side.",
          "Bio": {
            "BioID": "the-alan-parsons-project-eric-woolfson",
            "ArtistID": "the-alan-parsons-project",
            "ArtistName": "The Alan Parsons Project",
            "MemberName": "Eric Woolfson",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "1945-03-18",
              "City": "Glasgow",
              "Region": "Scotland",
              "Country": "United Kingdom",
              "Place": "Glasgow, Scotland, United Kingdom"
            },
            "Death": {
              "Date": "2009-12-02",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": "",
              "Cause": "Cancer"
            },
            "ActiveYears": "1960s–2000s",
            "AssociatedActs": [
              "The Alan Parsons Project"
            ],
            "KeyAlbums": [
              "Tales of Mystery and Imagination",
              "The Turn of a Friendly Card",
              "Eye in the Sky",
              "Gaudi"
            ],
            "KeySongs": [
              "Eye in the Sky",
              "Time",
              "Don't Answer Me"
            ],
            "Achievements": [
              "Primary songwriter/lyricist and creative driver of the Project’s concept-album approach.",
              "Later focused on musical theatre, adapting Project-era material into stage works."
            ],
            "ExternalLinks": {
              "OfficialSite": "https://www.ericwoolfsonmusic.com/",
              "Wikipedia": "https://en.wikipedia.org/wiki/Eric_Woolfson",
              "Discogs": "https://www.discogs.com/artist/254809-Eric-Woolfson"
            },
            "FullName": "Eric Woolfson",
            "PrimaryInstruments": [
              "Piano",
              "Keyboards",
              "Vocals"
            ],
            "Occupations": [
              "Songwriter",
              "Lyricist",
              "Pianist",
              "Singer",
              "Manager/producer"
            ],
            "Genres": [
              "Progressive rock",
              "Pop rock",
              "Art rock"
            ],
            "FullText": "Eric Woolfson (18 March 1945 – 2 December 2009) was a Scottish songwriter, pianist, and vocalist whose work sits at the center of The Alan Parsons Project. While Parsons supplied the studio architecture, Woolfson supplied the narrative drive: hooks, concepts, lyrics, and the melodic logic that made ambitious albums feel approachable. His talent was turning big themes into songs that still function as pop records.\n\nBefore the Project became a recognized name, Woolfson had already developed a practical understanding of how music is packaged and positioned. That background mattered because The Alan Parsons Project was not a conventional band—it was a production partnership that needed a clear identity. Woolfson helped define that identity in language, themes, and album-level storytelling, not just in chords and lyrics.\n\nWhen the duo formed the Project in 1975, Woolfson took on an unusually wide portfolio. He wrote or co-wrote much of the material, handled lyrics, played keyboards across the catalog, and contributed vocals where his tone fit the song. He also had a hand in organizing the Project’s direction—helping decide which concepts were worth building a full album around, and which vocalists should be featured to match each track’s character.\n\nWoolfson’s writing often works on two levels. On the surface, the songs are concise and hook-driven—easy to remember, easy to sing. Underneath, the lyrics and album sequencing are built to support a theme: technology’s promises, the psychology of risk, the seductions of modern image-making, or the tension between faith and doubt. That dual-layer approach is a major reason the Project could succeed with both album listeners and radio audiences.\n\nVocally, Woolfson also provided a recurring “Project” fingerprint. Even though the act used many guest singers, Woolfson’s own lead vocals appear on key tracks, and his backing contributions helped unify choruses. His vocal presence functioned like an additional instrument—another color in the palette—rather than a traditional frontman identity.\n\nAs the Project’s catalog progressed, Woolfson remained the anchor for conceptual coherence. A rotating cast can easily feel anonymous, but Woolfson’s songwriting kept the records personal and intentional. Listeners could sense a consistent point of view even when the lead voice changed, because the underlying writing voice remained stable.\n\nThe partnership with Parsons was central to Woolfson’s impact. Parsons could realize Woolfson’s ideas with unusually high fidelity and dramatic staging, while Woolfson supplied the material that made the production meaningful. The result is a catalog where songwriting and sound design are tightly coupled—neither is merely decorative.\n\nAfter the Project concluded, Woolfson increasingly focused on musical theatre and stage works. That direction makes sense in retrospect: the Project’s catalog is already theatrical in structure, with suites, reprises, and concept-driven sequencing. Woolfson’s later work extended that instinct into explicitly narrative, stage-oriented formats.\n\nWoolfson’s legacy is often summarized as “songwriter,” but in The Alan Parsons Project he functioned as a creative director. He helped create a model where albums could be built like films: themes first, then casting, then production, then final presentation. For listeners who value concept albums that still deliver pop satisfaction, his work remains a benchmark."
          }
        }
      ],
      "NonCoreMembers": [
        {
          "Name": "Ian Bairnson",
          "Roles": [
            "Electric and acoustic guitarist. The Project’s most regular instrumental contributor, featured across every studio album and central to its signature lead-guitar voice. A versatile session player beyond APP, he also worked with Pilot and recorded with artists including Kate Bush and Jon Anderson."
          ],
          "Years": "",
          "Instruments": [
            "Electric guitar",
            "Acoustic guitar",
            "Pedal steel (occasional)"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "I Robot",
            "Pyramid",
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Colin Blunstone",
          "Roles": [
            "Vocalist. Known for expressive, warm lead vocals on Project tracks, he is especially associated with the ballad “Old & Wise” and other reflective material. He was also the longtime lead singer of The Zombies, bringing a distinctive classic-pop sensibility to APP recordings."
          ],
          "Years": "",
          "Instruments": [
            "Vocals"
          ],
          "Albums": [
            "Pyramid",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Laurence Cottle",
          "Roles": [
            "Bass guitarist. Brought a modern, tight low-end feel to the later-era sessions, contributing to the Project’s final studio period. His playing helped maintain the Project’s polished foundation as the supporting cast evolved in the mid‑80s."
          ],
          "Years": "",
          "Instruments": [
            "Bass guitar"
          ],
          "Albums": [
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Richard Cottle",
          "Roles": [
            "Keyboardist and saxophonist. Added additional synth/key textures and sax colors during the Project’s later albums, supporting the denser mid‑80s arrangements. His parts helped broaden the palette while keeping the studio sheen intact."
          ],
          "Years": "",
          "Instruments": [
            "Keyboards",
            "Saxophone"
          ],
          "Albums": [
            "Vulture Culture",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Stuart Elliott",
          "Roles": [
            "Drummer and percussionist. Served as the Project’s primary drummer for much of its classic run, delivering crisp, controlled performances tailored to Parsons’ production style. He was also known for work with Steve Harley & Cockney Rebel, connecting him to the wider Parsons/Woolfson studio circle."
          ],
          "Years": "",
          "Instruments": [
            "Drums",
            "Percussion"
          ],
          "Albums": [
            "Pyramid",
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Jack Harris",
          "Roles": [
            "Vocalist. One of the early rotating lead voices, contributing distinctive vocals on debut-era and early concept material. His work illustrates the Project’s core method: selecting singers as “guest leads” to fit specific songs rather than building around a fixed frontman."
          ],
          "Years": "",
          "Instruments": [
            "Vocals"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "I Robot",
            "Pyramid"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "John Miles",
          "Roles": [
            "Vocalist. A powerful rock singer used for dramatic, theatrical tracks across multiple eras, including notable performances on Poe-themed and later concept material. He also had a successful solo career, bringing big-stage phrasing to the Project’s most intense songs."
          ],
          "Years": "",
          "Instruments": [
            "Vocals",
            "Guitar"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "Pyramid",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "David Paton",
          "Roles": [
            "Bass guitarist and vocalist. A key recurring contributor who provided bass and both lead/backing vocals on multiple albums, helping stabilize the Project’s sound across changing lead singers. Also known for work with Pilot, he bridged pop melody and studio precision in the APP ecosystem."
          ],
          "Years": "",
          "Instruments": [
            "Bass guitar",
            "Vocals"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "I Robot",
            "Pyramid",
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture",
            "Stereotomy"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Andrew Powell",
          "Roles": [
            "Orchestral and choral arranger/conductor. Expanded the Project’s cinematic scope with orchestral writing on nearly every album, reinforcing its concept-album drama and atmosphere. His arrangements helped the Project fuse rock instrumentation with symphonic color when the material called for it."
          ],
          "Years": "",
          "Instruments": [
            "Orchestration",
            "Conducting"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "I Robot",
            "Pyramid",
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Chris Rainbow",
          "Roles": [
            "Vocalist. A frequent lead and backing voice whose stacked harmonies became a recognizable ingredient in the Project’s polished sound. His bright, layered backing style often functioned like an additional instrument, adding lift and texture to choruses and transitions."
          ],
          "Years": "",
          "Instruments": [
            "Vocals"
          ],
          "Albums": [
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture",
            "Stereotomy",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Stuart Tosh",
          "Roles": [
            "Drummer. Contributed to the early sessions and helped set the tight rhythmic foundation of the first albums. His playing connects directly to the Project’s early network of musicians associated with Pilot and other Parsons-produced projects."
          ],
          "Years": "",
          "Instruments": [
            "Drums"
          ],
          "Albums": [
            "Tales of Mystery and Imagination",
            "I Robot"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        },
        {
          "Name": "Lenny Zakatek",
          "Roles": [
            "Vocalist. One of the Project’s most frequent lead singers on upbeat, radio-facing tracks, chosen for a bright, energetic delivery that cut through dense production. He also sang with the band Gonzalez, and his voice is strongly associated with several of the Project’s best-known singles and driving album cuts."
          ],
          "Years": "",
          "Instruments": [
            "Vocals"
          ],
          "Albums": [
            "I Robot",
            "Pyramid",
            "Eve",
            "The Turn of a Friendly Card",
            "Eye in the Sky",
            "Ammonia Avenue",
            "Vulture Culture",
            "Gaudi"
          ],
          "Replacing": [],
          "ReplacedBy": [],
          "Overview": ""
        }
      ],
      "Genres": [
        "Progressive rock",
        "Art rock",
        "Progressive pop",
        "Soft rock"
      ],
      "Labels": [
        "20th Century Records",
        "Arista",
        "Charisma"
      ],
      "Overview": "The Alan Parsons Project was a London-based studio partnership formed in 1975 by producer/engineer Alan Parsons and songwriter/keyboardist Eric Woolfson. The duo built the act around a simple idea: the “band” would be defined by songwriting, concepts, and sound design more than a fixed touring lineup. That approach let them treat the recording studio as their primary instrument—casting different vocalists and players to suit each track while keeping a consistent sonic identity from album to album.\n\nWoolfson supplied much of the conceptual framing and melodic writing, often organizing albums around a central theme—literature, technology, psychology, chance, faith, or modern ambition—while Parsons delivered a meticulous, high-clarity production style. The Project’s records are known for layered arrangements, tightly staged vocals, dramatic transitions, and a polished balance between progressive-rock texture and pop accessibility. Even when the lineup of singers changed, the albums retained a recognizable “Project” signature because the core duo controlled the writing and the final sound.\n\nBetween 1976 and 1987, the Project released ten studio albums, moving from the cinematic Edgar Allan Poe-inspired debut Tales of Mystery and Imagination into sleek, concept-leaning releases such as I Robot and The Turn of a Friendly Card. Their commercial high point arrived with Eye in the Sky, which paired the hit title track with the instrumental “Sirius.” The Project’s knack for building hooks inside sophisticated studio architecture helped it succeed on both album-oriented rock and mainstream radio.\n\nAlthough the original Project did not tour as a conventional band during its active studio run, its catalog remained highly portable: songs built for headphones and hi‑fi systems also translated into arenas and broadcasts. “Sirius” in particular developed a long afterlife as a sports-introduction and highlight staple, while tracks like “Time” and “Old and Wise” became durable fan favorites. In retrospect, The Alan Parsons Project stands as a major example of a producer-led, studio-first rock act whose identity was as much about sound and presentation as it was about songs.",
      "NotableAlbums": [
        {
          "Title": "Tales of Mystery and Imagination",
          "Year": 1976,
          "Notes": "Debut concept album inspired by Edgar Allan Poe; established the Project’s studio-first format."
        },
        {
          "Title": "I Robot",
          "Year": 1977,
          "Notes": "Breakthrough album that defined the Project’s sleek blend of progressive textures and pop structure."
        },
        {
          "Title": "The Turn of a Friendly Card",
          "Year": 1980,
          "Notes": "Gambling-themed concept album with extended suites and some of the Project’s most ambitious arrangements."
        },
        {
          "Title": "Eye in the Sky",
          "Year": 1982,
          "Notes": "Commercial peak featuring “Sirius” and the hit title track; widely regarded as the Project’s signature release."
        }
      ],
      "SignatureSongs": [
        "Eye in the Sky",
        "Sirius",
        "Games People Play",
        "Time",
        "Don't Answer Me",
        "Old and Wise",
        "I Wouldn't Want to Be Like You"
      ],
      "Achievements": [
        {
          "Type": "Grammy recognition",
          "Year": "1983 / 2019",
          "Detail": "Eye in the Sky received engineering recognition in the early 1980s and later won a Grammy in 2019 for Best Immersive Audio Album (for an immersive mix edition)."
        },
        {
          "Type": "Enduring cultural use",
          "Year": "1980s–present",
          "Detail": "“Sirius” became a long-running sports-arena and broadcast anthem, widely used for team introductions and high-energy stings."
        },
        {
          "Type": "Studio-first model",
          "Year": "1976–1987",
          "Detail": "The Project popularized a producer-led, rotating-guest approach that maintained a consistent sound across changing vocalists and players."
        }
      ],
      "KeyFacts": [
        "Official membership centered on Alan Parsons and Eric Woolfson; vocalists and musicians were invited album-by-album and track-by-track.",
        "The Project did not tour in its original era because it was designed as a studio collaboration with a rotating lineup.",
        "Ten studio albums were released between 1976 and 1987, with each album leaning into concept framing and meticulous production."
      ],
      "ExternalLinks": {
        "OfficialSite": "https://www.the-alan-parsons-project.com/",
        "AllMusic": "https://www.allmusic.com/artist/the-alan-parsons-project-mn0001176481",
        "Wikipedia": "https://en.wikipedia.org/wiki/The_Alan_Parsons_Project",
        "Discogs": "https://www.discogs.com/artist/26434-The-Alan-Parsons-Project"
      }
    },
    {
      "ArtistID": "the-beatles",
      "Name": "The Beatles",
      "Type": "",
      "Origin": {
        "City": "",
        "Region": "",
        "Country": ""
      },
      "YearsActive": [
        ""
      ],
      "CoreMembers": [
        {
          "Name": "",
          "Roles": [
            "",
            "",
            ""
          ],
          "Years": "",
          "Overview": "",
          "Bio": {
            "BioID": "",
            "ArtistID": "",
            "ArtistName": "",
            "MemberName": "",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": "",
              "Notes": ""
            },
            "Death": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Cause": "",
              "Place": "",
              "Age": 0
            },
            "ActiveYears": [
              ""
            ],
            "AssociatedActs": [
              "",
              "",
              "",
              ""
            ],
            "KeyAlbums": [
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              }
            ],
            "KeySongs": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Achievements": [
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              }
            ],
            "ExternalLinks": {
              "OfficialSite": "",
              "AllMusic": "",
              "RockHall": "",
              "Wikipedia": "",
              "Discogs": ""
            },
            "FullName": "",
            "PrimaryInstruments": [
              "",
              "",
              "",
              ""
            ],
            "Occupations": [
              "",
              "",
              "",
              "",
              "",
              ""
            ],
            "Genres": [
              "",
              "",
              ""
            ],
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            "",
            ""
          ],
          "Years": "",
          "Overview": "",
          "Bio": {
            "BioID": "",
            "ArtistID": "",
            "ArtistName": "",
            "MemberName": "",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": ""
            },
            "Death": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Cause": "",
              "Place": "",
              "Age": ""
            },
            "ActiveYears": [
              ""
            ],
            "AssociatedActs": [
              "",
              "",
              "",
              ""
            ],
            "KeyAlbums": [
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              }
            ],
            "KeySongs": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Achievements": [
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              }
            ],
            "ExternalLinks": {
              "OfficialSite": "",
              "AllMusic": "",
              "RockHall": "",
              "Wikipedia": "",
              "Discogs": ""
            },
            "FullName": "",
            "PrimaryInstruments": [
              "",
              "",
              "",
              ""
            ],
            "Occupations": [
              "",
              "",
              "",
              ""
            ],
            "Genres": [
              "",
              ""
            ],
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            "",
            ""
          ],
          "Years": "",
          "Overview": "",
          "Bio": {
            "BioID": "",
            "ArtistID": "",
            "ArtistName": "",
            "MemberName": "",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": ""
            },
            "Death": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Cause": "",
              "Age": 0
            },
            "ActiveYears": [
              ""
            ],
            "AssociatedActs": [
              "",
              "",
              "",
              ""
            ],
            "KeyAlbums": [
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              }
            ],
            "KeySongs": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Achievements": [
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              }
            ],
            "ExternalLinks": {
              "OfficialSite": "",
              "AllMusic": "",
              "RockHall": "",
              "Wikipedia": "",
              "Discogs": ""
            },
            "FullName": "",
            "PrimaryInstruments": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Occupations": [
              "",
              "",
              "",
              ""
            ],
            "Genres": [
              "",
              "",
              ""
            ],
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            ""
          ],
          "Years": "",
          "Overview": "",
          "Bio": {
            "BioID": "",
            "ArtistID": "",
            "ArtistName": "",
            "MemberName": "",
            "Biography": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Birth": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Place": ""
            },
            "Death": {
              "Date": "",
              "City": "",
              "Region": "",
              "Country": "",
              "Cause": "",
              "Place": "",
              "Age": ""
            },
            "ActiveYears": [
              ""
            ],
            "AssociatedActs": [
              "",
              "",
              "",
              ""
            ],
            "KeyAlbums": [
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              },
              {
                "Title": "",
                "Year": 0,
                "Notes": ""
              }
            ],
            "KeySongs": [
              "",
              "",
              "",
              "",
              ""
            ],
            "Achievements": [
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              },
              {
                "Type": "",
                "Year": 0,
                "Detail": ""
              }
            ],
            "ExternalLinks": {
              "OfficialSite": "",
              "AllMusic": "",
              "RockHall": "",
              "Wikipedia": "",
              "Discogs": ""
            },
            "FullName": "",
            "PrimaryInstruments": [
              "",
              ""
            ],
            "Occupations": [
              "",
              "",
              "",
              ""
            ],
            "Genres": [
              "",
              ""
            ],
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        }
      ],
      "NonCoreMembers": [
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Years": "",
          "Instruments": [
            ""
          ],
          "Albums": [
            ""
          ],
          "Replacing": [],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Years": "",
          "Instruments": [
            ""
          ],
          "Albums": [],
          "Replacing": [],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        }
      ],
      "Genres": [
        "",
        "",
        "",
        ""
      ],
      "Labels": [
        "",
        "",
        ""
      ],
      "Overview": "",
      "NotableAlbums": [
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        }
      ],
      "SignatureSongs": [
        "",
        "",
        "",
        "",
        ""
      ],
      "Achievements": [
        {
          "Type": "",
          "Year": 0,
          "Detail": ""
        },
        {
          "Type": "",
          "Year": "",
          "Detail": ""
        },
        {
          "Type": "",
          "Year": "",
          "Detail": ""
        }
      ],
      "KeyFacts": [
        "",
        "",
        "",
        ""
      ],
      "ExternalLinks": {
        "OfficialSite": "",
        "AllMusic": "",
        "Grammy": "",
        "Wikipedia": "",
        "Discogs": ""
      }
    },
    {
      "ArtistID": "ac-dc",
      "Name": "AC/DC",
      "Type": "",
      "Origin": {
        "City": "",
        "Region": "",
        "Country": ""
      },
      "YearsActive": [
        ""
      ],
      "Overview": "",
      "CoreMembers": [
        {
          "Name": "",
          "Roles": [
            "",
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            "",
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Death": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Death": {
              "Date": "",
              "Place": "",
              "Cause": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            ""
          ],
          "Instruments": [
            "",
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        },
        {
          "Name": "",
          "Roles": [
            "",
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Overview": "",
          "Bio": {
            "MemberName": "",
            "Birth": {
              "Date": "",
              "Place": ""
            },
            "Nationality": "",
            "Roles": "",
            "Instruments": "",
            "Overview": "",
            "Sources": [
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              },
              {
                "Title": "",
                "Url": "",
                "Accessed": ""
              }
            ]
          }
        }
      ],
      "NonCoreMembers": [
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [],
          "ReplacedBy": [
            "",
            "",
            "",
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [],
          "ReplacedBy": [
            "",
            "",
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [
            ""
          ],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [
            ""
          ],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [
            "",
            ""
          ],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        },
        {
          "Name": "",
          "Roles": [
            ""
          ],
          "Instruments": [
            ""
          ],
          "Years": "",
          "YearsActive": "",
          "Replacing": [
            ""
          ],
          "ReplacedBy": [
            ""
          ],
          "Overview": ""
        }
      ],
      "Genres": [
        "",
        "",
        ""
      ],
      "Labels": [
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "NotableAlbums": [
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        },
        {
          "Title": "",
          "Year": 0,
          "Notes": ""
        }
      ],
      "SignatureSongs": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      "Achievements": [
        {
          "Type": "",
          "Year": 0,
          "Detail": ""
        },
        {
          "Type": "",
          "Year": 0,
          "Detail": ""
        },
        {
          "Type": "",
          "Year": "",
          "Detail": ""
        }
      ],
      "KeyFacts": [
        "",
        "",
        "",
        ""
      ],
      "ExternalLinks": {
        "OfficialSite": "",
        "RockHall": "",
        "Wikipedia": "",
        "Discography": ""
      }
    },
    {
      "ArtistID": "aerosmith",
      "Name": "Aerosmith",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "america",
      "Name": "America",
      "Type": "Band",
      "Origin": {
        "City": "London",
        "Region": "England",
        "Country": "United Kingdom"
      },
      "YearsActive": [
        "1970–present"
      ],
      "Genres": [
        "soft rock",
        "folk rock",
        "pop rock",
        "country rock"
      ],
      "Labels": [
        "Warner Bros.",
        "Capitol",
        "Burgundy"
      ],
      "Overview": "America is a British‑American rock band formed in London in 1970 by Gerry Beckley, Dewey Bunnell, and Dan Peek. The trio—sons of U.S. Air Force personnel stationed in the U.K.—built a signature sound around close three‑part harmonies, acoustic guitars, and an easy melodic polish that fit both pop radio and album‑oriented rock.\n\nThey broke through internationally with the desert‑sketch hit “A Horse with No Name,” then followed with a long run of 1970s favorites like “Ventura Highway,” “Tin Man,” “Sister Golden Hair,” and “Lonely People.” After Peek’s departure in 1977, Beckley and Bunnell carried the name forward as a touring and recording act with a rotating supporting lineup, keeping the catalog in steady rotation across soft‑rock radio, compilations, and live stages.\n\nAmerica’s appeal has always been the blend of craft and atmosphere: hooks that feel instantly familiar, arrangements that leave breathing room, and vocals that land like a single unified instrument. Even when the band’s later work leaned more electric or more contemporary, the core identity stayed consistent—bright melodies, reflective lyrics, and a warm, sunlit sense of place.\n\nDecades on, America is still shorthand for a particular kind of classic‑rock comfort: songs that can soundtrack a road trip, a summer memory, or a late‑night radio dial, without ever losing the precision of their writing or the clarity of their harmonies.",
      "NotableAlbums": [
        {
          "Title": "America",
          "Year": "1971",
          "Notes": "The debut that introduced the trio’s harmony‑driven folk‑rock sound; later editions prominently featured “A Horse with No Name,” which helped push the band into international attention."
        },
        {
          "Title": "Homecoming",
          "Year": "1972",
          "Notes": "A fast follow‑up that reinforced the band’s melodic identity and produced fan‑favorite staples, balancing breezy acoustics with tighter pop structures."
        },
        {
          "Title": "Holiday",
          "Year": "1974",
          "Notes": "A polished mid‑’70s set that deepened the band’s studio sheen while keeping the songwriting lean, featuring a mix of radio‑ready hooks and more reflective album cuts."
        },
        {
          "Title": "Hearts",
          "Year": "1975",
          "Notes": "One of the era’s defining America albums, remembered for its smooth production and the enduring hit “Sister Golden Hair,” which captured the band’s pop‑rock peak."
        },
        {
          "Title": "View from the Ground",
          "Year": "1982",
          "Notes": "A key early‑’80s comeback moment that modernized the band’s sound without abandoning their harmonic core, anchored by the late‑career smash “You Can Do Magic.”"
        }
      ],
      "SignatureSongs": [
        {
          "Title": "A Horse with No Name",
          "Year": "1972",
          "Notes": "A desert‑drift classic that became the band’s breakout and a defining soft‑rock staple."
        },
        {
          "Title": "I Need You",
          "Year": "1972",
          "Notes": "A tender, harmony‑forward ballad that showcased the group’s pop instincts."
        },
        {
          "Title": "Ventura Highway",
          "Year": "1972",
          "Notes": "A warm, rolling road‑song that cemented America’s sunlit West‑Coast aura."
        },
        {
          "Title": "Tin Man",
          "Year": "1974",
          "Notes": "A melodic fan favorite with a gentle, storybook glide and signature vocal blend."
        },
        {
          "Title": "Sister Golden Hair",
          "Year": "1975",
          "Notes": "A crisp pop‑rock hit built on an instantly recognizable guitar figure and chorus."
        },
        {
          "Title": "Lonely People",
          "Year": "1975",
          "Notes": "A reflective single that paired optimism and melancholy in classic America fashion."
        },
        {
          "Title": "You Can Do Magic",
          "Year": "1982",
          "Notes": "A later‑era resurgence that brought America back to major radio play in the ’80s."
        }
      ],
      "Achievements": [
        {
          "Year": "1973",
          "Title": "Grammy Award – Best New Artist",
          "Details": "America won the Grammy for Best New Artist at the 15th Annual Grammy Awards, reflecting their rapid rise from a new trio to a major hit‑making act."
        },
        {
          "Year": "1972",
          "Title": "“A Horse with No Name” reaches No. 1 (U.S.)",
          "Details": "The single topped the Billboard Hot 100 and became the defining breakthrough that propelled the band’s early‑’70s success."
        },
        {
          "Year": "1970s",
          "Title": "Sustained multi‑hit run on pop and soft‑rock radio",
          "Details": "Across the decade, America placed a string of enduring singles into heavy rotation, establishing a catalog that remained a cornerstone of classic soft‑rock programming."
        }
      ],
      "KeyFacts": [
        "Formed in London in 1970 by Gerry Beckley, Dewey Bunnell, and Dan Peek while attending London Central High School in the U.K.",
        "Known for close three‑part harmonies and acoustic‑leaning arrangements that bridged folk‑rock and pop radio.",
        "Continued as a duo fronted by Beckley and Bunnell after Dan Peek’s departure in 1977, touring extensively with a rotating supporting lineup."
      ],
      "ExternalLinks": {
        "Official Site": "https://www.venturahighway.com/",
        "Wikipedia": "https://en.wikipedia.org/wiki/America_(band)",
        "Discography": "https://en.wikipedia.org/wiki/America_discography"
      },
      "CoreMembers": [
        {
          "Name": "Gerry Beckley",
          "Roles": [
            "founding member",
            "lead vocals",
            "guitar",
            "keyboards"
          ],
          "Years": "1970–present",
          "Overview": "Founding vocalist and multi‑instrumentalist whose melodic writing and smooth vocal delivery helped define America’s radio‑friendly sound.",
          "Bio": {
            "BioID": "america-gerry-beckley",
            "ArtistID": "america",
            "ArtistName": "America",
            "MemberName": "Gerry Beckley",
            "FullName": "Gerald Linford Beckley",
            "PrimaryInstruments": [
              "vocals",
              "guitar",
              "keyboards"
            ],
            "Occupations": [
              "singer-songwriter",
              "musician"
            ],
            "Genres": [
              "soft rock",
              "folk rock",
              "pop rock"
            ],
            "Birth": {
              "Date": "1952-09-12",
              "Place": "Fort Worth, Texas, U.S."
            },
            "ActiveYears": "1967–present",
            "AssociatedActs": [
              "America"
            ],
            "KeyAlbums": [
              "America",
              "Homecoming",
              "Hearts",
              "View from the Ground"
            ],
            "KeySongs": [
              "Sister Golden Hair",
              "I Need You"
            ],
            "Achievements": [
              "Grammy Award for Best New Artist (with America, 1973).",
              "Co-led one of the most enduring harmony-driven catalogs of 1970s soft rock."
            ],
            "ExternalLinks": {
              "Official Site": "https://gerrybeckley.com/",
              "Wikipedia": "https://en.wikipedia.org/wiki/Gerry_Beckley"
            },
            "Biography": "Gerry Beckley is a founding member of America, widely recognized for the band’s smooth vocal blend and gift for melodic, radio‑ready songwriting. Born in Fort Worth, Texas, he grew up around both American and British musical currents, which later helped America sound both familiar and slightly “out of place” in a way that made their early records stand out.\n\nFrom an early age, Beckley gravitated toward instruments and arrangement. He developed a songwriter’s instinct for chord movement and chorus lift, and he brought that sensibility into group settings—thinking not only about what a song says, but how it breathes, how it moves, and how vocals can act as the hook.\n\nBeckley met Dewey Bunnell and Dan Peek while attending London Central High School in the U.K. As the three began playing together, Beckley’s melodic discipline complemented Bunnell’s vivid imagery and Peek’s big, open‑hearted vocal presence. The trio’s harmonies became their calling card, and Beckley’s parts were often the glue—clean, centered, and tuned for the blend.\n\nAmerica’s early success demanded a balance between craft and immediacy. Beckley helped the band keep that balance by writing songs that sounded effortless while being carefully built: concise structures, clear emotional stakes, and melodies that felt like they’d always existed. That combination turned many tracks into long‑term radio staples rather than quick-chart curiosities.\n\nAs the band’s catalog expanded, Beckley remained a consistent musical anchor. Even when production trends shifted—more electric textures, brighter mixes, tighter pop framing—his songwriting sensibility kept pointing back to what made America work: melody first, harmony as identity, and arrangements that leave room for the voice.\n\nWhen Dan Peek departed in 1977, the band’s center of gravity changed. Beckley and Bunnell carried forward as the public face of America, and Beckley’s role widened: maintaining continuity, selecting collaborators, and ensuring that the classic sound translated to new lineups and changing eras without becoming a nostalgia act on autopilot.\n\nLive, Beckley became one of the band’s most recognizable presences—calm, precise, and tuned to the blend that audiences came to hear. The music depends on harmony and timing more than flash, and Beckley’s performance style reflects that: steady delivery, careful phrasing, and an ear for how each vocal line supports the whole.\n\nIn later decades, Beckley’s reputation has only strengthened among listeners who value songwriting as a craft. America’s best records don’t rely on tricks; they rely on structure, melody, and a sense of atmosphere. Beckley is central to that formula, consistently shaping songs that feel warm and direct without being simplistic.\n\nBeckley’s legacy inside America is the durability of the melody. Whether it’s a classic 1970s single or a deeper album track, his writing tends to hold up because it aims for clarity—musical, emotional, and vocal. That clarity is a big part of why America remains a permanent fixture in soft‑rock culture."
          }
        },
        {
          "Name": "Dewey Bunnell",
          "Roles": [
            "founding member",
            "lead vocals",
            "guitar",
            "songwriter"
          ],
          "Years": "1970–present",
          "Overview": "Founding singer and songwriter best known for vivid, image‑driven classics that helped define America’s early identity.",
          "Bio": {
            "BioID": "america-dewey-bunnell",
            "ArtistID": "america",
            "ArtistName": "America",
            "MemberName": "Dewey Bunnell",
            "FullName": "Lee Merton Bunnell",
            "PrimaryInstruments": [
              "vocals",
              "guitar",
              "percussion"
            ],
            "Occupations": [
              "musician",
              "singer-songwriter"
            ],
            "Genres": [
              "soft rock",
              "folk rock",
              "country rock"
            ],
            "Birth": {
              "Date": "1952-01-19",
              "Place": "Harrogate, Yorkshire, England"
            },
            "ActiveYears": "1969–present",
            "AssociatedActs": [
              "America"
            ],
            "KeyAlbums": [
              "America",
              "Homecoming",
              "Holiday",
              "Hearts",
              "View from the Ground"
            ],
            "KeySongs": [
              "A Horse with No Name",
              "Ventura Highway",
              "Tin Man"
            ],
            "Achievements": [
              "Grammy Award for Best New Artist (with America, 1973).",
              "Wrote several of the band’s most enduring signature songs."
            ],
            "ExternalLinks": {
              "Wikipedia": "https://en.wikipedia.org/wiki/Dewey_Bunnell"
            },
            "Biography": "Dewey Bunnell is a founding member of America and one of the key writing voices behind the band’s most iconic early hits. Born in Harrogate, Yorkshire, he grew up between cultures, and that “in‑between” perspective often shows up in his songs—places that feel real but slightly dreamlike, and lyrics that suggest a story without explaining every detail.\n\nBunnell’s musical identity is rooted in melody and imagery. He writes with a painter’s instinct, using small sensory cues—heat, distance, roads, horizons—to create a mood that listeners can step into immediately. That approach helped America stand apart from many contemporaries: their songs often feel like postcards rather than diary entries.\n\nHe met Gerry Beckley and Dan Peek at London Central High School in the U.K., where the three began shaping the harmonized acoustic style that would become America’s signature. In that early blend, Bunnell’s voice and phrasing added a distinct character—easygoing on the surface, but with a slightly mysterious edge that suited the band’s most atmospheric material.\n\nBunnell wrote “A Horse with No Name,” the song that broke America wide open. It’s built on minimal chords and a steady pulse, but it feels enormous because of its imagery and the way the vocal sits inside the arrangement. The track became a defining soft‑rock moment and established Bunnell as a songwriter who could turn a simple framework into a complete world.\n\nHe followed with other defining staples, including “Ventura Highway” and “Tin Man,” each showing a different shade of the same strength: memorable melodic turns, a clear emotional temperature, and lyrics that invite interpretation rather than dictating it. Bunnell’s writing often works like a scene—you can picture it even when the details are abstract.\n\nAfter Dan Peek left the band in 1977, Bunnell and Beckley carried America forward. In that era, Bunnell’s responsibilities expanded from being one voice among three to being one of the two anchors of the group’s identity. Keeping the harmony sound intact while adapting to new lineups required consistency, and Bunnell became a key stabilizing presence.\n\nOn stage, Bunnell’s work is central to what audiences come to hear: the classic hits delivered with warmth and precision. America’s music lives in its vocal blend, and Bunnell’s steadiness helps the songs retain their original feel even decades after their first release.\n\nBunnell’s long-term impact is that he helped define a style of soft rock that is both specific and flexible: acoustic-forward, harmony-led, and built on songs that can live comfortably in many settings. His best tracks are instantly recognizable but not locked to a single era.\n\nWithin America’s story, Bunnell represents the band’s most cinematic songwriting impulse—the ability to suggest distance, movement, and memory in a few lines and a strong chorus. That gift is a major reason America’s catalog keeps finding new listeners long after the original chart moments have passed."
          }
        },
        {
          "Name": "Dan Peek",
          "Roles": [
            "founding member",
            "lead vocals",
            "guitar",
            "bass",
            "songwriter"
          ],
          "Years": "1970–1977",
          "Overview": "Founding vocalist and songwriter whose warm tenor and emotional directness were central to America’s early trio sound.",
          "Bio": {
            "BioID": "america-dan-peek",
            "ArtistID": "america",
            "ArtistName": "America",
            "MemberName": "Dan Peek",
            "FullName": "Daniel Milton Peek",
            "PrimaryInstruments": [
              "vocals",
              "guitar",
              "bass"
            ],
            "Occupations": [
              "musician",
              "singer-songwriter"
            ],
            "Genres": [
              "soft rock",
              "folk rock",
              "pop rock"
            ],
            "Birth": {
              "Date": "1950-11-01",
              "Place": "Panama City, Florida, U.S."
            },
            "Death": {
              "Date": "2011-07-24",
              "Place": "Farmington, Missouri, U.S.",
              "Cause": "uremic pericarditis"
            },
            "ActiveYears": "1969–2011",
            "AssociatedActs": [
              "America"
            ],
            "KeyAlbums": [
              "America",
              "Homecoming",
              "Holiday",
              "Hearts"
            ],
            "KeySongs": [
              "Lonely People"
            ],
            "Achievements": [
              "Grammy Award for Best New Artist (with America, 1973).",
              "Co-shaped America’s classic three-part harmony sound during the band’s breakout decade."
            ],
            "ExternalLinks": {
              "Wikipedia": "https://en.wikipedia.org/wiki/Dan_Peek"
            },
            "Biography": "Dan Peek was a founding member of America and one of the three voices that defined the band’s early harmony sound. Born in Panama City, Florida, he experienced a mobile upbringing connected to military life, an environment that shaped both his worldview and his ability to adapt—qualities that later suited the band’s international “formed abroad” origin story.\n\nPeek met Gerry Beckley and Dewey Bunnell through London Central High School in the U.K. As the trio began writing and performing together, Peek’s voice brought a distinctive emotional weight. Where some of America’s songs drift like scenery, Peek’s performances often feel like confession—direct, heartfelt, and grounded.\n\nIn America’s breakthrough period, Peek contributed not only vocals but also instrumental work and songwriting. The trio’s appeal wasn’t just the harmony; it was the sense that three different writing personalities were feeding the same identity. Peek’s songs and vocal choices added sincerity and lift, helping the band avoid sounding merely mellow.\n\nPeek is closely associated with “Lonely People,” a song remembered for pairing gentle melody with an outward-looking, hopeful message. It captures a key part of America’s appeal: music that’s soft on the surface but not empty, and lyrics that try to reach the listener rather than posture at them.\n\nAs the band’s success accelerated through the 1970s, the pressures of constant visibility and touring grew. The trio’s harmony style is demanding—tight phrasing, controlled dynamics, and a strong sense of blend—and Peek’s role in maintaining that blend was essential to America’s early live and studio identity.\n\nIn 1977, Peek left America, and the group continued as a duo fronted by Beckley and Bunnell. His departure marked a clear dividing line in the band’s story: the shift from a three-part vocal signature to a two‑leader model supported by touring musicians. Even so, the early catalog remains inseparable from Peek’s voice and presence.\n\nAfter leaving, Peek pursued his own musical path and songwriting work. Listeners who revisit the early records can often hear how his sensibility shaped the trio—an emotional directness that complemented Beckley’s melodic polish and Bunnell’s cinematic imagery.\n\nPeek’s later life included continued creativity as well as personal challenges, and his story is often remembered with a sense of bittersweet distance: a key architect of a beloved sound who chose a different road once the original run had reached its limit for him.\n\nPeek died in 2011, but his contribution to America remains vivid every time the early hits play. The band’s classic harmony identity is a three-person equation, and Peek is one of the essential variables—his tone, phrasing, and songwriting still audible in the emotional center of the group’s defining era."
          }
        }
      ],
      "NonCoreMembers": [
        {
          "Name": "Willie Leacox",
          "Roles": [
            "touring member",
            "drums",
            "percussion"
          ],
          "Years": "1970s–present (touring eras)",
          "Instruments": [
            "drums",
            "percussion"
          ],
          "Albums": [],
          "Replacing": "",
          "ReplacedBy": "",
          "Overview": "Willie Leacox is a longtime drummer associated with America’s touring lineup, helping translate the band’s harmony‑driven studio classics into a steady, road‑tested live show. His playing tends to prioritize pocket and dynamics over flash, keeping the arrangements open for vocals while still giving the songs forward motion."
        },
        {
          "Name": "Michael Woods",
          "Roles": [
            "touring member",
            "guitar",
            "keyboards",
            "vocals"
          ],
          "Years": "1970s–present (touring eras)",
          "Instruments": [
            "guitar",
            "keyboards",
            "vocals"
          ],
          "Albums": [],
          "Replacing": "",
          "ReplacedBy": "",
          "Overview": "Michael Woods is a longtime supporting musician in America’s live band, covering guitar and keyboard textures that help the catalog feel full on stage. He’s known for matching the original records’ clean melodic lines and adding harmonic support that blends naturally into the band’s vocal-focused sound."
        },
        {
          "Name": "Richard Campbell",
          "Roles": [
            "touring member",
            "bass",
            "vocals"
          ],
          "Years": "2000s–present (touring eras)",
          "Instruments": [
            "bass",
            "vocals"
          ],
          "Albums": [],
          "Replacing": "Bradley Palmer (touring band)",
          "ReplacedBy": "",
          "Overview": "Richard Campbell is a bassist in America’s modern touring lineup, providing low-end stability and backing vocals in a set built around classic soft‑rock arrangements. His role is less about spotlight and more about consistency—locking the groove in place so the harmonies and acoustic-driven melodies can stay front and center."
        }
      ]
    },
    {
      "ArtistID": "the-allman-brothers-band",
      "Name": "The Allman Brothers Band",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-animals",
      "Name": "The Animals",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "asia",
      "Name": "Asia",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "bad-company",
      "Name": "Bad Company",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "badfinger",
      "Name": "Badfinger",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "bachman-turner-overdrive",
      "Name": "Bachman-Turner Overdrive",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-band",
      "Name": "The Band",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-beach-boys",
      "Name": "The Beach Boys",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "big-brother-and-the-holding-company",
      "Name": "Big Brother and the Holding Company",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "billy-joel",
      "Name": "Billy Joel",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "black-sabbath",
      "Name": "Black Sabbath",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "blondie",
      "Name": "Blondie",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "blue-oyster-cult",
      "Name": "Blue Öyster Cult",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "bob-dylan",
      "Name": "Bob Dylan",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "boston",
      "Name": "Boston",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "bread",
      "Name": "Bread",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "bruce-springsteen",
      "Name": "Bruce Springsteen",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "buffalo-springfield",
      "Name": "Buffalo Springfield",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-byrds",
      "Name": "The Byrds",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-cars",
      "Name": "The Cars",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "cat-stevens",
      "Name": "Cat Stevens",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "cheap-trick",
      "Name": "Cheap Trick",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "chicago",
      "Name": "Chicago",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-clash",
      "Name": "The Clash",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "cream",
      "Name": "Cream",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "creedence-clearwater-revival",
      "Name": "Creedence Clearwater Revival",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "crosby-stills-nash-young",
      "Name": "Crosby, Stills, Nash & Young",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "david-bowie",
      "Name": "David Bowie",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "deep-purple",
      "Name": "Deep Purple",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "def-leppard",
      "Name": "Def Leppard",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "derek-and-the-dominos",
      "Name": "Derek and the Dominos",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "dire-straits",
      "Name": "Dire Straits",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-doobie-brothers",
      "Name": "The Doobie Brothers",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-doors",
      "Name": "The Doors",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "electric-light-orchestra",
      "Name": "Electric Light Orchestra",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "eagles",
      "Name": "Eagles",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "emerson-lake-palmer",
      "Name": "Emerson, Lake & Palmer",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "eric-clapton",
      "Name": "Eric Clapton",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "fleetwood-mac",
      "Name": "Fleetwood Mac",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "foreigner",
      "Name": "Foreigner",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "frank-zappa",
      "Name": "Frank Zappa",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "genesis",
      "Name": "Genesis",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "golden-earring",
      "Name": "Golden Earring",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "grand-funk-railroad",
      "Name": "Grand Funk Railroad",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "grateful-dead",
      "Name": "Grateful Dead",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "heart",
      "Name": "Heart",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "iron-maiden",
      "Name": "Iron Maiden",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "jackson-browne",
      "Name": "Jackson Browne",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "james-taylor",
      "Name": "James Taylor",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "janis-joplin",
      "Name": "Janis Joplin",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "jefferson-airplane",
      "Name": "Jefferson Airplane",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "jethro-tull",
      "Name": "Jethro Tull",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "jimi-hendrix",
      "Name": "Jimi Hendrix",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "journey",
      "Name": "Journey",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "judas-priest",
      "Name": "Judas Priest",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "kansas",
      "Name": "Kansas",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "king-crimson",
      "Name": "King Crimson",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "kiss",
      "Name": "Kiss",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-kinks",
      "Name": "The Kinks",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "led-zeppelin",
      "Name": "Led Zeppelin",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "little-feat",
      "Name": "Little Feat",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "lynyrd-skynyrd",
      "Name": "Lynyrd Skynyrd",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "meat-loaf",
      "Name": "Meat Loaf",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-moody-blues",
      "Name": "The Moody Blues",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "motorhead",
      "Name": "Motörhead",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "mountain",
      "Name": "Mountain",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "nazareth",
      "Name": "Nazareth",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "neil-young",
      "Name": "Neil Young",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-police",
      "Name": "The Police",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-pretenders",
      "Name": "The Pretenders",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "queen",
      "Name": "Queen",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "rainbow",
      "Name": "Rainbow",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "ramones",
      "Name": "Ramones",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "r-e-m",
      "Name": "R.E.M.",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "reo-speedwagon",
      "Name": "REO Speedwagon",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "rod-stewart",
      "Name": "Rod Stewart",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "roxy-music",
      "Name": "Roxy Music",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "rush",
      "Name": "Rush",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "santana",
      "Name": "Santana",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "scorpions",
      "Name": "Scorpions",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "sex-pistols",
      "Name": "Sex Pistols",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "simon-garfunkel",
      "Name": "Simon & Garfunkel",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "steely-dan",
      "Name": "Steely Dan",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "steve-miller-band",
      "Name": "Steve Miller Band",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "steppenwolf",
      "Name": "Steppenwolf",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "styx",
      "Name": "Styx",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "supertramp",
      "Name": "Supertramp",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "t-rex",
      "Name": "T. Rex",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "talking-heads",
      "Name": "Talking Heads",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "thin-lizzy",
      "Name": "Thin Lizzy",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "tom-petty-and-the-heartbreakers",
      "Name": "Tom Petty and the Heartbreakers",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "van-halen",
      "Name": "Van Halen",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "the-who",
      "Name": "The Who",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "yes",
      "Name": "Yes",
      "CoreMembers": [],
      "NonCoreMembers": []
    },
    {
      "ArtistID": "zz-top",
      "Name": "ZZ Top",
      "CoreMembers": [],
      "NonCoreMembers": []
    }
  ]
}
