[
  {
    "ArtistID": "the-alan-parsons-project",
    "Name": "The Alan Parsons Project",
    "Type": "Duo",
    "Origin": {
      "City": "London",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "YearsActive": [
      "1975–1990"
    ],
    "CoreMembers": [
      {
        "Name": "Alan Parsons",
        "Roles": [
          "producer",
          "audio engineer",
          "composer",
          "musician"
        ],
        "Years": "1975–1990",
        "Overview": "",
        "Bio": {
          "BioID": "alan-parsons__the-alan-parsons-project",
          "ArtistID": "the-alan-parsons-project",
          "ArtistName": "The Alan Parsons Project",
          "MemberName": "Alan Parsons",
          "Biography": [
            "Alan Parsons (born 20 December 1948) is an English producer, audio engineer, and musician whose work helped define the sound of classic ‘studio rock’ in the 1970s and 1980s. He built a reputation for clarity, dynamics, and meticulous detail—traits that later became the calling card of the Alan Parsons Project.",
            "Parsons trained at EMI/Abbey Road Studios and worked on major sessions as an assistant engineer, including late‑era Beatles recordings. He later engineered Pink Floyd’s *The Dark Side of the Moon*, a landmark album whose sonic craft became a touchstone for audiophile rock production.",
            "In the mid‑1970s, Parsons partnered with songwriter Eric Woolfson to create the Alan Parsons Project: a concept‑album studio venture where Parsons produced and engineered the recordings while a rotating cast of vocalists and players brought each song to life. The Project’s best‑known run includes albums like *I Robot*, *The Turn of a Friendly Card*, and *Eye in the Sky*.",
            "Beyond the Project, Parsons continued as a producer and artist in his own right, releasing solo albums and later touring with the Alan Parsons Live Project. His career is frequently cited for its technical excellence and for proving that rock records could be both radio‑friendly and sonically ambitious.",
            "Across decades of work, Parsons has accumulated major industry recognition (including multiple Grammy nominations) and remains influential among producers and engineers for his combination of musical taste and technical discipline."
          ],
          "Birth": {
            "Date": "1948-12-20",
            "City": "Willesden (London)",
            "Region": "England",
            "Country": "United Kingdom",
            "Place": "Willesden, Middlesex, England"
          },
          "Death": {
            "Date": "",
            "City": "",
            "Region": "",
            "Country": "",
            "Cause": "",
            "Place": "",
            "Age": ""
          },
          "ActiveYears": [
            "1967–present"
          ],
          "AssociatedActs": [
            "The Alan Parsons Project"
          ],
          "KeyAlbums": [
            {
              "Title": "I Robot",
              "Year": 1977,
              "Notes": "A defining Project album noted for its concept, polish, and progressive-pop balance."
            },
            {
              "Title": "Eye in the Sky",
              "Year": 1982,
              "Notes": "A major commercial peak featuring one of the Project’s signature singles."
            }
          ],
          "KeySongs": [
            "Eye in the Sky",
            "Games People Play",
            "Time",
            "Don’t Answer Me"
          ],
          "Achievements": [
            {
              "Type": "Grammy nomination",
              "Year": 1973,
              "Detail": "Grammy nomination for Best Engineered Album, Non-Classical (Pink Floyd – The Dark Side of the Moon)."
            },
            {
              "Type": "Royal honour (OBE)",
              "Year": 2021,
              "Detail": "Appointed Officer of the Order of the British Empire (OBE) for services to music and music production."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://alanparsons.com/",
            "AllMusic": "https://www.allmusic.com/artist/alan-parsons-mn0000031274",
            "Wikipedia": "https://en.wikipedia.org/wiki/Alan_Parsons",
            "Discogs": "https://www.discogs.com/artist/10881-Alan-Parsons"
          },
          "FullName": "Alan Parsons",
          "PrimaryInstruments": [
            "Keyboards",
            "Guitar",
            "Vocals"
          ],
          "Occupations": [
            "Audio engineer",
            "Record producer",
            "Musician",
            "Composer"
          ],
          "Genres": [
            "Progressive rock",
            "Rock"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Alan Parsons",
              "Url": "https://en.wikipedia.org/wiki/Alan_Parsons",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Abbey Road Studios: Alan Parsons feature",
              "Url": "https://www.abbeyroad.com/news/the-genius-of-alan-parsons-as-told-by-abbey-roads-cameron-colbeck-2716",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Official site: Alan Parsons",
              "Url": "https://www.the-alan-parsons-project.com/alan-parsons",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Eric Woolfson",
        "Roles": [
          "songwriter",
          "lyricist",
          "pianist",
          "vocalist",
          "executive producer"
        ],
        "Years": "1975–1990",
        "Overview": "",
        "Bio": {
          "BioID": "eric-woolfson__the-alan-parsons-project",
          "ArtistID": "the-alan-parsons-project",
          "ArtistName": "The Alan Parsons Project",
          "MemberName": "Eric Woolfson",
          "Biography": [
            "Eric Woolfson (18 March 1945 – 2 December 2009) was a Scottish songwriter, lyricist, vocalist, and keyboardist who co‑created the Alan Parsons Project and served as its conceptual engine. He was central to the band’s thematic approach—building album frameworks, writing lyrics, and shaping melodies that could function as both progressive rock narratives and accessible pop songs.",
            "In the early 1970s Woolfson worked in London as a songwriter, composer, and session musician. Through Abbey Road Studios he met Alan Parsons in 1974, and the two formed a close working partnership that blended Woolfson’s concept‑building with Parsons’ production and engineering strengths.",
            "As the Project’s co‑founder, Woolfson shared writing credits on most of the catalog and often recorded guide vocals that helped define how songs would ultimately be sung by the Project’s rotating lead vocalists. He also sang lead or prominent parts on several tracks, giving the discography a recognizable emotional tone alongside the guest singers.",
            "After the Project era, Woolfson increasingly focused on musical‑theatre work and large‑scale writing projects, continuing to develop the storytelling instincts that had driven the band’s concept albums. His later output includes stage‑oriented works alongside continuing interest in the Project’s musical legacy.",
            "Woolfson died in London in 2009 after illness, leaving behind a catalog that remains widely listened to for its melodies, themes, and the distinctive partnership he built with Parsons."
          ],
          "Birth": {
            "Date": "1945-03-18",
            "City": "Glasgow",
            "Region": "Scotland",
            "Country": "United Kingdom",
            "Place": "Charing Cross, Glasgow, Scotland"
          },
          "Death": {
            "Date": "2009-12-02",
            "City": "London",
            "Region": "England",
            "Country": "United Kingdom",
            "Cause": "Kidney cancer",
            "Age": 64
          },
          "ActiveYears": [
            "1960s–2009"
          ],
          "AssociatedActs": [
            "The Alan Parsons Project"
          ],
          "KeyAlbums": [
            {
              "Title": "Tales of Mystery and Imagination",
              "Year": 1976,
              "Notes": "The Project’s debut concept album, rooted in Edgar Allan Poe themes."
            },
            {
              "Title": "The Turn of a Friendly Card",
              "Year": 1980,
              "Notes": "A concept record blending progressive structure with pop-oriented songwriting."
            }
          ],
          "KeySongs": [
            "Time",
            "Don’t Answer Me",
            "Games People Play",
            "Old and Wise"
          ],
          "Achievements": [
            {
              "Type": "Co-founder",
              "Year": 1975,
              "Detail": "Co-founded The Alan Parsons Project and served as its primary songwriter/lyricist and a lead vocalist on many recordings."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://www.ericwoolfsonmusic.com/biography",
            "Wikipedia": "https://en.wikipedia.org/wiki/Eric_Woolfson",
            "Discogs": "https://www.discogs.com/artist/194052-Eric-Woolfson"
          },
          "FullName": "Eric Norman Woolfson",
          "PrimaryInstruments": [
            "Piano",
            "Keyboards",
            "Vocals"
          ],
          "Occupations": [
            "Songwriter",
            "Lyricist",
            "Vocalist",
            "Pianist",
            "Executive producer"
          ],
          "Genres": [
            "Progressive rock",
            "Soft rock",
            "Musical theatre"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Eric Woolfson",
              "Url": "https://en.wikipedia.org/wiki/Eric_Woolfson",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Official site: Eric Woolfson biography",
              "Url": "https://www.ericwoolfsonmusic.com/biography",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: The Alan Parsons Project",
              "Url": "https://en.wikipedia.org/wiki/The_Alan_Parsons_Project",
              "Accessed": "2025-12-31"
            }
          ]
        }
      }
    ],
    "NonCoreMembers": [
      {
        "Name": "Ian Bairnson",
        "Roles": [
          "guitars"
        ],
        "Years": "1975–1990",
        "Instruments": [
          "guitars"
        ],
        "Albums": [
          "All Alan Parsons Project studio albums (1976–1990)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Ian Bairnson was the Project’s signature guitarist—featured across all of the band’s studio albums and central to the clean, melodic lead sound that fans often associate with the catalog. A former member of Pilot, he first connected with Parsons through the London studio scene and became a go‑to player for both precise rhythm textures and memorable solos (notably on “I Wouldn’t Want to Be Like You”). Outside the Project, Bairnson’s session work was unusually wide‑ranging, including prominent parts on several Kate Bush albums and the iconic solo on “Wuthering Heights.” He remained a trusted collaborator for Parsons beyond the Project era and was widely remembered for taste, tone, and musicality rather than flash."
      },
      {
        "Name": "David Paton",
        "Roles": [
          "bass",
          "vocals"
        ],
        "Years": "1975–1985 (regular); later appearances",
        "Instruments": [
          "bass guitar",
          "vocals"
        ],
        "Albums": [
          "Regular on classic-era albums (1970s–mid 1980s); appeared across much of the catalog"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "David Paton—best known as a founder of Pilot—provided bass and frequent vocals for the Alan Parsons Project through much of its classic period. His playing helped anchor the Project’s tight, radio‑friendly grooves while still leaving space for layered arrangements, orchestration, and studio detail. Paton’s voice also became part of the Project’s recognizable blend, often used for harmonies and support vocals that complemented the rotating lead singers. Beyond APP, he maintained a long career in British rock and pop as a songwriter, performer, and session musician, and he remained connected to the wider circle of Parsons collaborators over the decades."
      },
      {
        "Name": "Stuart Tosh",
        "Roles": [
          "drums",
          "percussion"
        ],
        "Years": "1975–1978",
        "Instruments": [
          "drums",
          "percussion"
        ],
        "Albums": [
          "Tales of Mystery and Imagination (1976)",
          "I Robot (1977)"
        ],
        "Replacing": [],
        "ReplacedBy": [
          "Stuart Elliott (replaced Tosh starting with Pyramid (1978))"
        ],
        "Overview": "Stuart Tosh was the drummer on the Project’s earliest sessions and helped establish the crisp, driving feel that powered the first wave of albums. Coming from the same Scottish musician network that included Pilot, Tosh’s style fit the Project’s early mix of rock energy and studio precision, supporting both heavier tracks and more cinematic, arranged material. After leaving the Project’s regular lineup, he continued working at a high professional level with major artists and bands, building a reputation as a reliable, musical drummer in both studio and live settings. His contributions are part of the band’s formative ‘studio‑rats’ era, when the sound was being defined record by record."
      },
      {
        "Name": "Stuart Elliott",
        "Roles": [
          "drums",
          "percussion"
        ],
        "Years": "1978–1990",
        "Instruments": [
          "drums",
          "percussion"
        ],
        "Albums": [
          "Pyramid (1978) onward (regular drummer)"
        ],
        "Replacing": [
          "Stuart Tosh"
        ],
        "ReplacedBy": [],
        "Overview": "Stuart Elliott became the Project’s primary drummer starting with *Pyramid* and stayed in that role through the band’s long run, giving the catalog a consistent rhythmic identity even as vocalists and textures changed. His playing is marked by strong pocket, controlled dynamics, and a ‘record‑ready’ precision that suited Parsons’ meticulous production style. Elliott also worked widely as a session drummer outside the Project and later remained involved in related collaborations with other APP‑connected musicians. For many listeners, his drumming is one of the subtle constants that ties the Project’s concept albums together—supporting everything from punchy singles to slower, atmospheric tracks without drawing attention away from the arrangement."
      },
      {
        "Name": "Billy Lyall",
        "Roles": [
          "keyboards"
        ],
        "Years": "mid-1970s (contributor)",
        "Instruments": [
          "keyboards"
        ],
        "Albums": [
          "Early Project sessions (contributor)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Billy Lyall was a Scottish keyboardist and vocalist best known for his work with Pilot and for appearing within the broader circle of musicians who fed into the Alan Parsons Project. His contributions helped reinforce the Project’s studio‑ensemble approach: different players were brought in as needed, but certain names returned often enough to feel like part of the ‘family’ sound. Lyall’s background in harmony‑rich pop and polished studio recording fit naturally with Parsons and Woolfson’s emphasis on clarity, layered parts, and tight performances. While not as publicly visible as the duo at the center, his presence reflects how the Project relied on seasoned multi‑instrumentalists to realize ambitious arrangements efficiently."
      },
      {
        "Name": "Andrew Powell",
        "Roles": [
          "orchestral arrangements",
          "composition"
        ],
        "Years": "1976–1987 (regular arranger)",
        "Instruments": [
          "orchestral arrangements",
          "composition"
        ],
        "Albums": [
          "All studio albums except Vulture Culture (1985) — orchestra/choir arrangements"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Andrew Powell served as the Project’s key arranger and musical architect on the orchestral side, translating Woolfson and Parsons’ conceptual sketches into cinematic textures. His orchestrations and conducting helped the band bridge progressive rock, pop, and classical color—an especially important ingredient on albums where choir and orchestra were integral to the mood. Powell’s role also extended to keyboard and composition contributions, making him one of the most influential recurring collaborators beyond the official duo. In practical terms, he helped make the Project’s ‘big ideas’ sound expensive and coherent: sweeping strings, dramatic crescendos, and carefully voiced ensemble parts that sit cleanly inside Parsons’ detailed mixes."
      },
      {
        "Name": "Richard Cottle",
        "Roles": [
          "synthesizers",
          "keyboards",
          "saxophone"
        ],
        "Years": "1985–1990 (regular contributor)",
        "Instruments": [
          "synthesizers",
          "keyboards",
          "saxophone"
        ],
        "Albums": [
          "Vulture Culture (1985) and later studio albums — regular contributor"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Richard “Trix” Cottle joined the Project in the mid‑1980s as a dedicated synthesizer and keyboard specialist and became increasingly important as the band leaned into more digital production and programmed textures. A versatile session musician who also played saxophone, Cottle helped modernize the Project’s palette on later albums, supporting sequenced rhythms, layered synth pads, and brighter contemporary tones without losing the band’s polished identity. His work exemplifies the Project’s studio‑first method: bring in the right specialist to execute demanding parts quickly and cleanly, then integrate them into a mix built for impact and clarity. Cottle later maintained a wide session career beyond the Project."
      }
    ],
    "Genres": [
      "progressive rock",
      "art rock",
      "progressive pop",
      "soft rock"
    ],
    "Labels": [
      "20th Century Records",
      "Charisma",
      "Arista"
    ],
    "Overview": "The Alan Parsons Project were a London‑based studio duo built around producer/engineer Alan Parsons and songwriter/keyboardist Eric Woolfson. Formed in 1975, they specialized in concept‑driven albums that merged progressive rock, pop hooks, orchestral color, and meticulous, hi‑fi production, with different lead vocalists and session players brought in to match each song’s character. Their records often revolve around big thematic frames—Edgar Allan Poe, science and technology, gambling and fate, surveillance and perception—while still delivering radio‑ready melodies.\n\nAcross eleven studio albums (1976–1990), the Project scored international success with albums like *I Robot*, *The Turn of a Friendly Card*, and *Eye in the Sky*, and songs such as “Eye in the Sky,” “Sirius,” “Games People Play,” and “Time.” The ‘Project’ model—officially a duo with a recurring core of musicians—became part of the appeal: familiar sonic fingerprints (guitars, drums, orchestration, layered vocals) were combined with rotating voices.\n\nAlthough the band concluded its run in 1990, the catalog has remained a reference point for audiophile production and polished studio rock. Parsons continued with solo releases and touring under his own name, while Woolfson pursued writing and musical‑theatre projects until his death in 2009.",
    "NotableAlbums": [
      {
        "Title": "Tales of Mystery and Imagination",
        "Year": 1976,
        "Notes": "Debut concept album inspired by Edgar Allan Poe; introduced the Project’s studio‑ensemble model."
      },
      {
        "Title": "I Robot",
        "Year": 1977,
        "Notes": "Breakthrough concept record themed around technology and humanity; a signature title in their catalog."
      },
      {
        "Title": "Pyramid",
        "Year": 1978,
        "Notes": "Album‑rock staple noted for spacious production and recurring instrumental motifs."
      },
      {
        "Title": "The Turn of a Friendly Card",
        "Year": 1980,
        "Notes": "Concept album built around gambling and fate; includes enduring live and radio favorites."
      },
      {
        "Title": "Eye in the Sky",
        "Year": 1982,
        "Notes": "Their biggest commercial era; features “Sirius” and “Eye in the Sky,” showcasing polished pop‑prog craft."
      },
      {
        "Title": "Ammonia Avenue",
        "Year": 1984,
        "Notes": "A sleek mid‑80s entry balancing softer songs and punchier rock tracks within a refined studio sound."
      },
      {
        "Title": "Stereotomy",
        "Year": 1985,
        "Notes": "A more digital, synth‑forward production that pushed the Project’s modernized mid‑80s palette."
      },
      {
        "Title": "Gaudi",
        "Year": 1987,
        "Notes": "Late‑era concept album inspired by Antoni Gaudí; blends orchestration with a contemporary 80s sheen."
      }
    ],
    "SignatureSongs": [
      "Eye in the Sky",
      "Sirius",
      "Games People Play",
      "Time",
      "Don't Answer Me",
      "I Wouldn't Want to Be Like You",
      "Lucifer"
    ],
    "Achievements": [
      {
        "Type": "Grammy nomination",
        "Year": "1983",
        "Detail": "Eye in the Sky was nominated for the Grammy Award for Best Engineered Recording, Non-Classical (25th Annual Grammy Awards)."
      },
      {
        "Type": "Grammy win (immersive audio)",
        "Year": "2019",
        "Detail": "Eye in the Sky (35th Anniversary Edition) won the Grammy Award for Best Immersive Audio Album (61st Annual Grammy Awards)."
      }
    ],
    "KeyFacts": [
      "Official members were Alan Parsons and Eric Woolfson; recordings featured rotating vocalists and session musicians.",
      "Formed in London in 1975; released eleven studio albums from 1976 to 1990.",
      "Known for concept-album themes and meticulous, hi-fi studio production."
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.the-alan-parsons-project.com/",
      "AllMusic": "https://www.allmusic.com/artist/the-alan-parsons-project-mn0001176481",
      "Wikipedia": "https://en.wikipedia.org/wiki/The_Alan_Parsons_Project",
      "Discogs": "https://www.discogs.com/artist/66916-The-Alan-Parsons-Project"
    }
  },
  {
    "ArtistID": "the-beatles",
    "Name": "The Beatles",
    "Type": "Band",
    "Origin": {
      "City": "Liverpool",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "YearsActive": [
      "1960–1970"
    ],
    "CoreMembers": [
      {
        "Name": "John Lennon",
        "Roles": [
          "vocals",
          "guitar",
          "songwriting"
        ],
        "Years": "1960–1970",
        "Overview": "Co‑founder, primary vocalist and guitarist whose songwriting with Paul McCartney defined much of the band’s voice; later a major solo artist and activist.",
        "Bio": {
          "BioID": "john-lennon__the-beatles",
          "ArtistID": "the-beatles",
          "ArtistName": "The Beatles",
          "MemberName": "John Lennon",
          "Biography": [
            "John Lennon (1940–1980) was an English singer, songwriter, and guitarist whose partnership with Paul McCartney powered the Beatles’ most celebrated work. Raised in Liverpool, he developed an early love of American rock and roll and skiffle, forming the Quarrymen in the late 1950s—an early step toward what became the Beatles.",
            "Within the Beatles, Lennon balanced biting humor with emotional directness, moving from early rockers and ballads to increasingly personal and experimental writing as the 1960s progressed. His voice and rhythmic guitar anchored the band’s sound, while his curiosity pushed the group toward new lyrical and studio territory.",
            "By the mid-to-late 1960s Lennon’s life and art became closely intertwined with his relationship with Yoko Ono, and the pair’s avant‑garde projects and public activism made him a prominent cultural figure beyond music. He also played a central role in the band’s shifting identity after touring ended and studio work intensified.",
            "Following the Beatles’ breakup, Lennon pursued a solo career that ranged from intimate confessionals to politically charged work, maintaining a distinctive mix of blunt honesty and melodic craft. His songs from this era broadened his reputation as both an artist and a public voice.",
            "Lennon was killed in New York City in December 1980. His legacy endures through his Beatles catalog, influential solo recordings, and the enduring model of a songwriting partnership that shaped modern popular music."
          ],
          "Birth": {
            "Date": "1940-10-09",
            "City": "Liverpool",
            "Region": "England",
            "Country": "United Kingdom",
            "Place": "Liverpool, England",
            "Notes": "Born in Liverpool; rose to prominence as a co-founder of The Beatles."
          },
          "Death": {
            "Date": "1980-12-08",
            "City": "New York City",
            "Region": "New York",
            "Country": "United States",
            "Cause": "Gunshot wounds (assassinated)",
            "Place": "New York City, New York, U.S.",
            "Age": 40
          },
          "ActiveYears": [
            "1956–1980"
          ],
          "AssociatedActs": [
            "The Quarrymen",
            "The Beatles",
            "Plastic Ono Band",
            "The Dirty Mac"
          ],
          "KeyAlbums": [
            {
              "Title": "John Lennon/Plastic Ono Band",
              "Year": 1970,
              "Notes": "A stark, influential solo statement rooted in confession and minimalism."
            },
            {
              "Title": "Imagine",
              "Year": 1971,
              "Notes": "His best-known solo album, balancing political edge with pop accessibility."
            },
            {
              "Title": "Double Fantasy",
              "Year": 1980,
              "Notes": "A late-career collaboration/parallel statement with Yoko Ono, released shortly before his death."
            }
          ],
          "KeySongs": [
            "Imagine",
            "Instant Karma!",
            "Working Class Hero",
            "Give Peace a Chance",
            "#9 Dream"
          ],
          "Achievements": [
            {
              "Type": "Rock & Roll Hall of Fame (The Beatles)",
              "Year": 1988,
              "Detail": "Inducted with The Beatles (Category: Performer)."
            },
            {
              "Type": "Royal honour (MBE)",
              "Year": 1965,
              "Detail": "Appointed Members of the Order of the British Empire (MBE) with The Beatles."
            },
            {
              "Type": "Rock & Roll Hall of Fame (solo)",
              "Year": 1994,
              "Detail": "Inducted as a solo performer (Category: Performer)."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://www.johnlennon.com/",
            "AllMusic": "https://www.allmusic.com/artist/john-lennon-mn0000232564",
            "RockHall": "https://rockhall.com/inductees/john-lennon/",
            "Wikipedia": "https://en.wikipedia.org/wiki/John_Lennon",
            "Discogs": "https://www.discogs.com/artist/46439-John-Lennon"
          },
          "FullName": "John Winston Ono Lennon",
          "PrimaryInstruments": [
            "Vocals",
            "Guitar",
            "Keyboards",
            "Harmonica"
          ],
          "Occupations": [
            "Singer",
            "Songwriter",
            "Musician",
            "Artist",
            "Author",
            "Peace activist"
          ],
          "Genres": [
            "Rock",
            "Pop",
            "Experimental"
          ],
          "Sources": [
            {
              "Title": "Britannica: John Lennon",
              "Url": "https://www.britannica.com/biography/John-Lennon",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: John Lennon",
              "Url": "https://rockhall.com/inductees/john-lennon/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: John Lennon (cause of death, instruments)",
              "Url": "https://en.wikipedia.org/wiki/John_Lennon",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: The Beatles",
              "Url": "https://rockhall.com/inductees/beatles/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Time: Ringo Starr knighthood (MBE mention)",
              "Url": "https://time.com/5207582/ringo-starr-knighthood/",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Paul McCartney",
        "Roles": [
          "vocals",
          "bass",
          "songwriting"
        ],
        "Years": "1960–1970",
        "Overview": "Co‑founder, primary vocalist and multi‑instrumentalist whose melodic songwriting and bass style were central to the band; later led Wings and sustained a major solo career.",
        "Bio": {
          "BioID": "paul-mccartney__the-beatles",
          "ArtistID": "the-beatles",
          "ArtistName": "The Beatles",
          "MemberName": "Paul McCartney",
          "Biography": [
            "Paul McCartney (born 1942) is an English singer, songwriter, bassist, and multi‑instrumentalist whose melodic sensibility and studio versatility were crucial to the Beatles. Growing up in Liverpool, he joined John Lennon’s group in the late 1950s and soon formed one of popular music’s defining songwriting partnerships.",
            "As the Beatles evolved, McCartney contributed a wide range of styles—from tight early pop to ornate studio compositions—while also helping shape arrangements and recording approaches. His bass lines became increasingly prominent and inventive, and he often steered projects with a strong sense of structure and finish.",
            "In the late 1960s, as tensions rose, McCartney frequently acted as a driver of productivity, pushing the band toward completed recordings even as their personal and business relationships frayed. His interest in orchestration, concept framing, and studio detail left a lasting mark on the group’s later work.",
            "After the Beatles ended, McCartney built a major post‑Beatles career, notably forming Wings and sustaining decades of solo success. His work spans rock, pop, classical and experimental collaborations, reflecting the breadth that was already evident within the Beatles.",
            "McCartney remains one of the most decorated and commercially successful songwriters in modern music, and his Beatles-era output continues to define the benchmark for pop craftsmanship and melodic invention."
          ],
          "Birth": {
            "Date": "1942-06-18",
            "City": "Liverpool",
            "Region": "England",
            "Country": "United Kingdom",
            "Place": "Liverpool, England"
          },
          "Death": {
            "Date": "",
            "City": "",
            "Region": "",
            "Country": "",
            "Cause": "",
            "Place": "",
            "Age": ""
          },
          "ActiveYears": [
            "1957–present"
          ],
          "AssociatedActs": [
            "The Quarrymen",
            "The Beatles",
            "Wings",
            "The Fireman"
          ],
          "KeyAlbums": [
            {
              "Title": "Band on the Run",
              "Year": 1973,
              "Notes": "A defining Wings album and a cornerstone of his post-Beatles catalog."
            },
            {
              "Title": "Ram",
              "Year": 1971,
              "Notes": "A home‑studio‑leaning solo statement later hailed for its inventive pop craft."
            },
            {
              "Title": "McCartney",
              "Year": 1970,
              "Notes": "A self-contained early solo record that set the template for DIY pop-rock."
            }
          ],
          "KeySongs": [
            "Maybe I’m Amazed",
            "Live and Let Die",
            "Band on the Run",
            "Let It Be",
            "Hey Jude"
          ],
          "Achievements": [
            {
              "Type": "Rock & Roll Hall of Fame (The Beatles)",
              "Year": 1988,
              "Detail": "Inducted with The Beatles (Category: Performer)."
            },
            {
              "Type": "Royal honour (MBE)",
              "Year": 1965,
              "Detail": "Appointed Members of the Order of the British Empire (MBE) with The Beatles."
            },
            {
              "Type": "Rock & Roll Hall of Fame (solo)",
              "Year": 1999,
              "Detail": "Inducted as a solo performer (Category: Performer)."
            },
            {
              "Type": "Royal honour (Knighthood)",
              "Year": 1997,
              "Detail": "Knighted for services to music."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://www.paulmccartney.com/",
            "AllMusic": "https://www.allmusic.com/artist/paul-mccartney-mn0000029884",
            "RockHall": "https://rockhall.com/inductees/paul-mccartney/",
            "Wikipedia": "https://en.wikipedia.org/wiki/Paul_McCartney",
            "Discogs": "https://www.discogs.com/artist/35301-Paul-McCartney"
          },
          "FullName": "Sir James Paul McCartney",
          "PrimaryInstruments": [
            "Bass",
            "Vocals",
            "Guitar",
            "Keyboards"
          ],
          "Occupations": [
            "Singer",
            "Songwriter",
            "Composer",
            "Musician"
          ],
          "Genres": [
            "Rock",
            "Pop"
          ],
          "Sources": [
            {
              "Title": "Britannica: Paul McCartney",
              "Url": "https://www.britannica.com/biography/Paul-McCartney",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: Paul McCartney",
              "Url": "https://rockhall.com/inductees/paul-mccartney/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "History.com: Paul McCartney knighted (1997)",
              "Url": "https://www.history.com/this-day-in-history/march-11/paul-mccartney-knighted",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: The Beatles",
              "Url": "https://rockhall.com/inductees/beatles/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Time: Ringo Starr knighthood (MBE mention)",
              "Url": "https://time.com/5207582/ringo-starr-knighthood/",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "George Harrison",
        "Roles": [
          "guitar",
          "vocals",
          "songwriting"
        ],
        "Years": "1960–1970",
        "Overview": "Lead guitarist whose distinctive phrasing and evolving songwriting expanded the band’s sound; later acclaimed for All Things Must Pass and extensive charity work.",
        "Bio": {
          "BioID": "george-harrison__the-beatles",
          "ArtistID": "the-beatles",
          "ArtistName": "The Beatles",
          "MemberName": "George Harrison",
          "Biography": [
            "George Harrison (1943–2001) was an English guitarist and songwriter whose playing and compositional growth helped expand the Beatles beyond early pop conventions. Joining the group as a teenager, he became known for precise lead work, memorable riffing, and an evolving interest in new sounds and musical traditions.",
            "Across the band’s middle and later years, Harrison developed into a major writer, contributing songs that added emotional depth and a distinctive perspective alongside Lennon and McCartney. His curiosity for instrumentation and texture—ranging from sharp rock guitar to more layered studio colors—became part of the Beatles’ expanding palette.",
            "Harrison’s spiritual interests and engagement with Indian music shaped some of the band’s most recognizable sonic signatures of the era, while also influencing broader Western pop trends. As the 1960s progressed, his work increasingly reflected a personal voice and mature songwriting craft.",
            "After the Beatles, Harrison released the acclaimed triple album All Things Must Pass and remained an active recording artist. He also became known for major philanthropic efforts, including the Concert for Bangladesh, which helped establish the model for large‑scale benefit concerts.",
            "Harrison’s legacy rests on his distinctive guitar style, his late‑era Beatles songwriting, and a solo career that affirmed him as far more than a supporting figure within the band’s early narrative."
          ],
          "Birth": {
            "Date": "1943-02-25",
            "City": "Liverpool",
            "Region": "England",
            "Country": "United Kingdom",
            "Place": "Liverpool, England"
          },
          "Death": {
            "Date": "2001-11-29",
            "City": "Los Angeles",
            "Region": "California",
            "Country": "United States",
            "Cause": "Cancer",
            "Age": 58
          },
          "ActiveYears": [
            "1958–2001"
          ],
          "AssociatedActs": [
            "The Quarrymen",
            "The Beatles",
            "Traveling Wilburys",
            "Plastic Ono Band"
          ],
          "KeyAlbums": [
            {
              "Title": "All Things Must Pass",
              "Year": 1970,
              "Notes": "A landmark triple-album widely regarded as a peak post‑Beatles solo statement."
            },
            {
              "Title": "Living in the Material World",
              "Year": 1973,
              "Notes": "A major follow-up blending introspection with spiritual themes."
            },
            {
              "Title": "Cloud Nine",
              "Year": 1987,
              "Notes": "A late-career resurgence featuring polished pop-rock and renewed visibility."
            }
          ],
          "KeySongs": [
            "My Sweet Lord",
            "What Is Life",
            "Here Comes the Sun",
            "While My Guitar Gently Weeps",
            "Give Me Love (Give Me Peace on Earth)"
          ],
          "Achievements": [
            {
              "Type": "Rock & Roll Hall of Fame (The Beatles)",
              "Year": 1988,
              "Detail": "Inducted with The Beatles (Category: Performer)."
            },
            {
              "Type": "Royal honour (MBE)",
              "Year": 1965,
              "Detail": "Appointed Members of the Order of the British Empire (MBE) with The Beatles."
            },
            {
              "Type": "Rock & Roll Hall of Fame (solo)",
              "Year": 2004,
              "Detail": "Inducted posthumously as a solo performer (Category: Performer)."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://www.georgeharrison.com/",
            "AllMusic": "https://www.allmusic.com/artist/george-harrison-mn0000209142",
            "RockHall": "https://rockhall.com/inductees/george-harrison/",
            "Wikipedia": "https://en.wikipedia.org/wiki/George_Harrison",
            "Discogs": "https://www.discogs.com/artist/35323-George-Harrison"
          },
          "FullName": "George Harrison",
          "PrimaryInstruments": [
            "Guitar",
            "Vocals",
            "Sitar",
            "Keyboards",
            "Ukulele"
          ],
          "Occupations": [
            "Musician",
            "Singer",
            "Songwriter",
            "Producer"
          ],
          "Genres": [
            "Rock",
            "Pop",
            "Indian classical"
          ],
          "Sources": [
            {
              "Title": "Britannica: George Harrison",
              "Url": "https://www.britannica.com/biography/George-Harrison-British-musician",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: George Harrison",
              "Url": "https://rockhall.com/inductees/george-harrison/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: George Harrison (death details)",
              "Url": "https://en.wikipedia.org/wiki/George_Harrison",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: The Beatles",
              "Url": "https://rockhall.com/inductees/beatles/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Time: Ringo Starr knighthood (MBE mention)",
              "Url": "https://time.com/5207582/ringo-starr-knighthood/",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Ringo Starr",
        "Roles": [
          "drums",
          "vocals"
        ],
        "Years": "1962–1970",
        "Overview": "Drummer whose feel and musicality shaped the group’s rhythm and arrangements; later a successful solo artist and leader of the All Starr Band.",
        "Bio": {
          "BioID": "ringo-starr__the-beatles",
          "ArtistID": "the-beatles",
          "ArtistName": "The Beatles",
          "MemberName": "Ringo Starr",
          "Biography": [
            "Ringo Starr (born 1940) is an English drummer and singer whose feel, timing, and musical restraint were central to the Beatles’ rhythm section. Joining in 1962, he completed the classic lineup and quickly became integral to the band’s sound and onstage identity.",
            "Starr’s drumming emphasized song-first choices—creative fills, steady groove, and an ear for arrangement—helping define many of the Beatles’ most famous recordings. His approachable persona also made him a key part of the group’s public appeal during the height of Beatlemania.",
            "As the Beatles’ music grew more adventurous, Starr adapted fluidly, supporting rapid stylistic shifts while maintaining a consistent internal pulse. His vocal turns, often lighter in tone, provided contrast within albums dominated by the Lennon–McCartney partnership.",
            "After the breakup, Starr enjoyed notable solo success and developed a long-running performance project, the All Starr Band, which highlights collaborative musicianship and classic rock repertoire. He has remained closely identified with the Beatles’ legacy while maintaining an active public and musical life.",
            "Starr’s enduring reputation reflects not only his iconic role in the world’s most influential band, but also the often-underappreciated artistry of a drummer whose parts became inseparable from the songs themselves."
          ],
          "Birth": {
            "Date": "1940-07-07",
            "City": "Liverpool",
            "Region": "England",
            "Country": "United Kingdom",
            "Place": "Liverpool, Merseyside, England"
          },
          "Death": {
            "Date": "",
            "City": "",
            "Region": "",
            "Country": "",
            "Cause": "",
            "Place": "",
            "Age": ""
          },
          "ActiveYears": [
            "1957–present"
          ],
          "AssociatedActs": [
            "Rory Storm & the Hurricanes",
            "The Beatles",
            "Plastic Ono Band",
            "Ringo Starr & His All-Starr Band"
          ],
          "KeyAlbums": [
            {
              "Title": "Ringo",
              "Year": 1973,
              "Notes": "A standout solo release featuring strong songwriting support and wide recognition."
            },
            {
              "Title": "Goodnight Vienna",
              "Year": 1974,
              "Notes": "A major mid‑70s follow‑up from his most commercially visible solo period."
            }
          ],
          "KeySongs": [
            "It Don’t Come Easy",
            "Photograph",
            "Back Off Boogaloo",
            "You’re Sixteen",
            "Octopus’s Garden"
          ],
          "Achievements": [
            {
              "Type": "Rock & Roll Hall of Fame (The Beatles)",
              "Year": 1988,
              "Detail": "Inducted with The Beatles (Category: Performer)."
            },
            {
              "Type": "Royal honour (MBE)",
              "Year": 1965,
              "Detail": "Appointed Members of the Order of the British Empire (MBE) with The Beatles."
            },
            {
              "Type": "Rock & Roll Hall of Fame (solo)",
              "Year": 2015,
              "Detail": "Inducted (Category: Musical Excellence)."
            },
            {
              "Type": "Royal honour (Knighthood)",
              "Year": 2018,
              "Detail": "Knighted for services to music."
            }
          ],
          "ExternalLinks": {
            "OfficialSite": "https://www.ringostarr.com/",
            "AllMusic": "https://www.allmusic.com/artist/ringo-starr-mn0000217792",
            "RockHall": "https://rockhall.com/inductees/ringo-starr/",
            "Wikipedia": "https://en.wikipedia.org/wiki/Ringo_Starr",
            "Discogs": "https://www.discogs.com/artist/257527-Ringo-Starr"
          },
          "FullName": "Sir Richard Starkey",
          "PrimaryInstruments": [
            "Drums",
            "Vocals"
          ],
          "Occupations": [
            "Musician",
            "Singer",
            "Songwriter",
            "Actor"
          ],
          "Genres": [
            "Rock",
            "Pop"
          ],
          "Sources": [
            {
              "Title": "Britannica: Ringo Starr",
              "Url": "https://www.britannica.com/biography/Ringo-Starr",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: Ringo Starr",
              "Url": "https://rockhall.com/inductees/ringo-starr/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: The Beatles",
              "Url": "https://rockhall.com/inductees/beatles/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Time: Ringo Starr knighthood (2018)",
              "Url": "https://time.com/5207582/ringo-starr-knighthood/",
              "Accessed": "2025-12-31"
            }
          ]
        }
      }
    ],
    "NonCoreMembers": [
      {
        "Name": "Pete Best",
        "Roles": [
          "drums"
        ],
        "Years": "1960–1962",
        "Instruments": [
          "drums"
        ],
        "Albums": [
          "Anthology 1 (1995) — archival early recordings (drums on 10 tracks)"
        ],
        "Replacing": [],
        "ReplacedBy": [
          "Ringo Starr"
        ],
        "Overview": "Pete Best is the British drummer who played with the Beatles during their crucial early years in Liverpool and Hamburg, appearing with them through 1960–1962 as the group built its local reputation and stagecraft. He performed on early recordings from that period, including sessions connected to the band’s pre‑fame work, and became part of the story of the Beatles’ final lineup change. In August 1962, Beatles manager Brian Epstein informed Best that he was being replaced by Ringo Starr shortly before the band’s breakthrough in Britain. Although his tenure ended just as the Beatles entered the studio-driven phase that made them famous, Best remains an important figure in the band’s origin story and has continued to be referenced in biographies, interviews, and archival releases tied to the early Beatles era."
      },
      {
        "Name": "Stuart Sutcliffe",
        "Roles": [
          "bass"
        ],
        "Years": "1960–1961",
        "Instruments": [
          "bass guitar"
        ],
        "Albums": [],
        "Replacing": [],
        "ReplacedBy": [
          "Paul McCartney (switched to bass after Sutcliffe left)"
        ],
        "Overview": "Stuart Sutcliffe was the Beatles’ original bassist and a close friend of John Lennon from art school, performing with the group during 1960–1961, including the early Hamburg period. More widely known as a painter than a career musician, Sutcliffe contributed to the band’s earliest identity—both visually and socially—during the years before the classic four‑member lineup solidified. He left the Beatles in 1961 to focus on art and to remain in Hamburg, where he studied and developed his work within the city’s creative scene. Sutcliffe died in April 1962 at age 21 in Hamburg. Though he did not participate in the band’s later recording successes, he is frequently cited in Beatles history as a key part of the group’s formative chapter and early circle."
      }
    ],
    "Genres": [
      "rock",
      "pop",
      "beat",
      "psychedelia"
    ],
    "Labels": [
      "Parlophone",
      "Capitol",
      "Apple"
    ],
    "Overview": "The Beatles were an English rock band formed in Liverpool in 1960—John Lennon, Paul McCartney, George Harrison, and (from 1962) Ringo Starr. Across an unusually short run, they moved from tight, harmony‑driven pop and R&B into studio‑era experimentation, helping redefine what a rock band could be in songwriting, recording, and cultural impact.\n\nAfter a rapid rise from the Merseybeat scene to international fame, the group’s mid‑1960s work expanded in scope and ambition, culminating in landmark albums such as Rubber Soul, Revolver, and Sgt. Pepper’s Lonely Hearts Club Band. They also pioneered modern touring and media phenomena—“Beatlemania”—while their films and public persona made them central figures of 1960s youth culture.\n\nInternal business and personal tensions grew late in the decade, especially after manager Brian Epstein’s death, and the Beatles formally disbanded in 1970. Their catalog remains one of the most influential in popular music, with decades of reissues, archival releases, and renewed attention to their recording innovations and songwriting legacy.",
    "NotableAlbums": [
      {
        "Title": "Please Please Me",
        "Year": 1963,
        "Notes": "Early breakthrough UK album capturing their live energy."
      },
      {
        "Title": "Rubber Soul",
        "Year": 1965,
        "Notes": "A pivot toward more sophisticated songwriting and textures."
      },
      {
        "Title": "Revolver",
        "Year": 1966,
        "Notes": "Studio experimentation and genre expansion."
      },
      {
        "Title": "Sgt. Pepper's Lonely Hearts Club Band",
        "Year": 1967,
        "Notes": "Defining concept-album statement of the era."
      },
      {
        "Title": "The Beatles (White Album)",
        "Year": 1968,
        "Notes": "Eclectic double album spanning multiple styles."
      },
      {
        "Title": "Abbey Road",
        "Year": 1969,
        "Notes": "Late-era studio peak with medley-driven side two."
      },
      {
        "Title": "Let It Be",
        "Year": 1970,
        "Notes": "Final released studio album, documented by the Let It Be film project."
      }
    ],
    "SignatureSongs": [
      "Hey Jude",
      "Let It Be",
      "Yesterday",
      "A Day in the Life",
      "Come Together"
    ],
    "Achievements": [
      {
        "Type": "Rock & Roll Hall of Fame",
        "Year": 1988,
        "Detail": "Inducted as performers; their influence is frequently cited as foundational to modern rock and pop."
      },
      {
        "Type": "GRAMMY Awards",
        "Year": "multiple",
        "Detail": "Won multiple GRAMMY awards and has received continued recognition for archival and legacy releases."
      },
      {
        "Type": "RIAA certifications (United States)",
        "Year": "multiple",
        "Detail": "Consistently ranks among the highest-certified music acts in the United States by RIAA album-equivalent units."
      }
    ],
    "KeyFacts": [
      "Formed in Liverpool in 1960; formally disbanded in 1970.",
      "Core lineup solidified in 1962 when Ringo Starr replaced Pete Best on drums.",
      "Evolved rapidly from early rock-and-roll/pop into psychedelic and studio-forward experimentation (1965–1969).",
      "Key late-era studio milestones include Abbey Road (1969) and the Let It Be project (released 1970)."
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.thebeatles.com/",
      "AllMusic": "https://www.allmusic.com/artist/the-beatles-mn0000754032",
      "Grammy": "https://www.grammy.com/artists/beatles/16293",
      "Wikipedia": "https://en.wikipedia.org/wiki/The_Beatles",
      "Discogs": "https://www.discogs.com/artist/82730-The-Beatles"
    }
  },
  {
    "ArtistID": "acdc",
    "Name": "AC/DC",
    "Type": "Band",
    "Origin": {
      "City": "Sydney",
      "Region": "New South Wales",
      "Country": "Australia"
    },
    "YearsActive": "1973–present (hiatus: 2016–2018)",
    "CoreMembers": [
      {
        "Name": "Angus Young",
        "Roles": [
          "lead guitar",
          "songwriting",
          "occasional backing vocals"
        ],
        "Years": "1973–present",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-angus-young",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Angus Young",
          "Biography": [
            "Angus Young co‑founded AC/DC in Sydney in 1973 with his older brother Malcolm, building the band around short, electrified riffs and relentless groove. His lead playing—rooted in blues phrasing and aggressive rhythmic picking—became the band’s signature voice, while his onstage “schoolboy” look turned him into one of rock’s most recognizable performers.",
            "As AC/DC grew from Australian club circuit to international phenomenon, Angus’s solos and stagecraft became central to the live show. Records such as *Let There Be Rock* and *Highway to Hell* captured a lean, hard sound that translated directly to arenas, with Angus’s leads often functioning like a second vocal hook.",
            "After the death of Bon Scott in 1980, Angus helped steer the band through a crucial reinvention with Brian Johnson. *Back in Black* kept the formula intact while sharpening it, and Angus’s playing on tracks like “Hells Bells” and “You Shook Me All Night Long” became canonical hard‑rock reference points.",
            "Through later eras—*The Razors Edge* and beyond—Angus maintained AC/DC’s identity by resisting trends and doubling down on feel, tone, and groove. Even as lineups shifted and long breaks occurred, his role as musical anchor has kept the band’s sound instantly identifiable."
          ],
          "Birth": {
            "Date": "1955-03-31",
            "Place": "Glasgow, Scotland (raised in Sydney, Australia)"
          },
          "ActiveYears": "1970–present",
          "AssociatedActs": [
            "AC/DC"
          ],
          "KeyAlbums": [
            "Let There Be Rock (1977)",
            "Highway to Hell (1979)",
            "Back in Black (1980)",
            "The Razors Edge (1990)",
            "Power Up (2020)"
          ],
          "KeySongs": [
            "Highway to Hell",
            "Back in Black",
            "Thunderstruck",
            "Hells Bells",
            "You Shook Me All Night Long"
          ],
          "Achievements": [
            "Co-founded AC/DC in 1973 and remains its only continuous member.",
            "Rock & Roll Hall of Fame inductee as a member of AC/DC (2003)."
          ],
          "ExternalLinks": {},
          "FullName": "Angus McKinnon Young",
          "PrimaryInstruments": [
            "guitar"
          ],
          "Occupations": [
            "musician",
            "songwriter",
            "producer"
          ],
          "Genres": [
            "hard rock",
            "blues rock",
            "rock and roll"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Angus Young (birth details, role, career)",
              "Url": "https://en.wikipedia.org/wiki/Angus_Young",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Rock Hall: AC/DC (induction, impact)",
              "Url": "https://rockhall.com/inductees/acdc/",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Malcolm Young",
        "Roles": [
          "rhythm guitar",
          "backing vocals",
          "songwriting",
          "band architect"
        ],
        "Years": "1973–2014",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-malcolm-young",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Malcolm Young",
          "Biography": [
            "Malcolm Young was AC/DC’s rhythmic engine and organizational backbone—often described as the band’s architect as much as its rhythm guitarist. Co‑founding the group in 1973 with his brother Angus, Malcolm shaped the band’s “no‑nonsense” approach: tight arrangements, hard grooves, and songs built for the stage.",
            "His playing emphasized precision and swing rather than flash, locking riffs to the drum pattern so the whole band hit like a single machine. Across the 1970s run—from *High Voltage* through *Highway to Hell*—Malcolm’s rhythm parts and co‑writing created the template for stadium hard rock: simple structures, huge choruses, and riffs that function like hooks.",
            "After Bon Scott’s death, Malcolm helped guide AC/DC through the transition to Brian Johnson and into *Back in Black*, where the writing tightened further and the band’s sound became globally dominant. He remained a co‑writer and key decision‑maker through decades of touring, keeping the band’s identity consistent even as rock trends shifted around them.",
            "Malcolm retired in 2014 due to dementia, and his nephew Stevie Young stepped in on rhythm guitar. He died in 2017, but his influence remains inseparable from AC/DC’s catalog—proof that rhythm guitar can be as defining as the lead."
          ],
          "Birth": {
            "Date": "1953-01-06",
            "Place": "Glasgow, Scotland (raised in Sydney, Australia)"
          },
          "ActiveYears": "1969–2014",
          "AssociatedActs": [
            "AC/DC"
          ],
          "KeyAlbums": [
            "High Voltage (1975)",
            "Let There Be Rock (1977)",
            "Highway to Hell (1979)",
            "Back in Black (1980)",
            "Rock or Bust (2014)"
          ],
          "KeySongs": [
            "T.N.T.",
            "Whole Lotta Rosie",
            "Highway to Hell",
            "Back in Black",
            "For Those About to Rock (We Salute You)"
          ],
          "Achievements": [
            "Co-founded AC/DC in 1973; principal rhythm guitarist and co-songwriter for the band’s classic catalog.",
            "Rock & Roll Hall of Fame inductee as a member of AC/DC (2003)."
          ],
          "ExternalLinks": {},
          "FullName": "Malcolm Mitchell Young",
          "PrimaryInstruments": [
            "guitar",
            "vocals"
          ],
          "Occupations": [
            "musician",
            "songwriter"
          ],
          "Genres": [
            "hard rock",
            "blues rock"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Malcolm Young (dates, role, retirement)",
              "Url": "https://en.wikipedia.org/wiki/Malcolm_Young",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Pitchfork: Malcolm Young obituary (retirement due to dementia, legacy)",
              "Url": "https://pitchfork.com/news/acdc-guitarist-malcolm-young-dead-at-64",
              "Accessed": "2025-12-31"
            }
          ],
          "Death": {
            "Date": "2017-11-18",
            "Place": "Elizabeth Bay, New South Wales, Australia"
          }
        }
      },
      {
        "Name": "Brian Johnson",
        "Roles": [
          "lead vocals",
          "songwriting"
        ],
        "Years": "1980–2016, 2018–present",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-brian-johnson",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Brian Johnson",
          "Biography": [
            "Brian Johnson became AC/DC’s lead vocalist in 1980, stepping into one of rock’s most scrutinized roles after the death of Bon Scott. Previously known for his work with the British band Geordie, Johnson brought a rasping, high‑powered delivery that matched AC/DC’s riffs while giving the band a slightly different vocal edge.",
            "His first album with the group, *Back in Black*, was recorded quickly but landed as a career‑defining statement—both a tribute to Scott and a demonstration that AC/DC could continue without changing their musical DNA. Johnson’s performances on “Hells Bells” and “You Shook Me All Night Long” helped turn the album into a cornerstone of hard rock.",
            "Through the 1980s and 1990s he fronted multiple eras, including the early ’80s stadium peak and the 1990 resurgence around *The Razors Edge*. His vocal character—gritty, direct, and built for call‑and‑response choruses—became integral to AC/DC’s identity for successive generations of listeners.",
            "After health-related touring interruptions in the mid‑2010s, Johnson returned for *Power Up* and renewed live activity, reinforcing his place as the voice of AC/DC’s post‑1980 legacy."
          ],
          "Birth": {
            "Date": "1947-10-05",
            "Place": "Dunston, County Durham, England"
          },
          "ActiveYears": "1962–present",
          "AssociatedActs": [
            "AC/DC",
            "Geordie"
          ],
          "KeyAlbums": [
            "Back in Black (1980)",
            "For Those About to Rock (We Salute You) (1981)",
            "The Razors Edge (1990)",
            "Black Ice (2008)",
            "Power Up (2020)"
          ],
          "KeySongs": [
            "Hells Bells",
            "You Shook Me All Night Long",
            "Back in Black",
            "For Those About to Rock (We Salute You)",
            "Thunderstruck"
          ],
          "Achievements": [
            "Joined AC/DC in 1980 after Bon Scott’s death; fronted *Back in Black*, one of rock’s defining albums.",
            "Rock & Roll Hall of Fame inductee as a member of AC/DC (2003)."
          ],
          "ExternalLinks": {},
          "FullName": "Brian Francis Johnson",
          "PrimaryInstruments": [
            "vocals"
          ],
          "Occupations": [
            "singer",
            "songwriter"
          ],
          "Genres": [
            "hard rock",
            "rock and roll"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Brian Johnson (birth details, Geordie, joining AC/DC)",
              "Url": "https://en.wikipedia.org/wiki/Brian_Johnson",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: Back in Black (context of Scott’s death and album’s tribute)",
              "Url": "https://en.wikipedia.org/wiki/Back_in_Black",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Phil Rudd",
        "Roles": [
          "drums"
        ],
        "Years": "1975–1983, 1994–2015, 2018–present",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-phil-rudd",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Phil Rudd",
          "Biography": [
            "Phil Rudd is the drummer most associated with AC/DC’s definitive feel: steady, uncluttered, and heavy without rushing. Joining in 1975, he helped the band tighten into the classic engine‑room groove heard across *Let There Be Rock*, *Powerage*, and *Highway to Hell*.",
            "Rudd’s playing is often described as deceptively simple—focused on backbeat authority and a pocket that lets guitars dominate while the rhythm section stays immovable. That approach became crucial on *Back in Black*, where the drums function as a metronomic foundation for some of rock’s most famous riffs.",
            "After leaving in the early 1980s, Rudd later returned for the mid‑1990s reunion and again for the band’s late‑era recording lineup on *Power Up*. Across his stints, his consistency has been a major reason AC/DC’s sound feels instantly recognizable regardless of decade."
          ],
          "Birth": {
            "Date": "1954-05-19",
            "Place": "Melbourne, Victoria, Australia"
          },
          "ActiveYears": "1972–present",
          "AssociatedActs": [
            "AC/DC",
            "Buster Brown"
          ],
          "KeyAlbums": [
            "Let There Be Rock (1977)",
            "Highway to Hell (1979)",
            "Back in Black (1980)",
            "The Razors Edge (1990)",
            "Power Up (2020)"
          ],
          "KeySongs": [
            "Whole Lotta Rosie",
            "Highway to Hell",
            "Back in Black",
            "Thunderstruck"
          ],
          "Achievements": [
            "Known for the band’s signature ‘straight but swinging’ groove; key drummer on many classic AC/DC albums.",
            "Rock & Roll Hall of Fame inductee as a member of AC/DC (2003)."
          ],
          "ExternalLinks": {},
          "FullName": "Phillip Hugh Norman Rudd (born Phillip Hugh Norman Witschke Rudzevecuis)",
          "PrimaryInstruments": [
            "drums"
          ],
          "Occupations": [
            "musician"
          ],
          "Genres": [
            "hard rock",
            "blues rock",
            "rock and roll"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Phil Rudd (birth details, AC/DC stints)",
              "Url": "https://en.wikipedia.org/wiki/Phil_Rudd",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: Power Up (personnel)",
              "Url": "https://en.wikipedia.org/wiki/Power_Up_(album)",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Cliff Williams",
        "Roles": [
          "bass guitar",
          "backing vocals"
        ],
        "Years": "1977–2016, 2018–present",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-cliff-williams",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Cliff Williams",
          "Biography": [
            "Cliff Williams joined AC/DC in 1977, arriving just as the band’s international momentum accelerated. His bass playing emphasized solidity and drive—supporting the guitars with locked-in eighth‑notes—while his backing vocals added a crucial layer to AC/DC’s trademark choruses.",
            "Williams’s first studio album with the group was *Powerage* (1978), and he became a mainstay through the band’s most famous run from *Highway to Hell* to *Back in Black*. In performance, his role was less about flashy lines and more about making the riffs hit harder by reinforcing rhythm and harmony at the same time.",
            "After announcing retirement around the band’s 2016 touring pause, Williams returned for *Power Up* and subsequent activity, reflecting the durable chemistry of AC/DC’s core late‑era lineup."
          ],
          "Birth": {
            "Date": "1949-12-14",
            "Place": "Romford, Essex, England"
          },
          "ActiveYears": "1966–present",
          "AssociatedActs": [
            "AC/DC",
            "Home",
            "Bandit"
          ],
          "KeyAlbums": [
            "Powerage (1978)",
            "Highway to Hell (1979)",
            "Back in Black (1980)",
            "The Razors Edge (1990)",
            "Power Up (2020)"
          ],
          "KeySongs": [
            "You Shook Me All Night Long",
            "Back in Black",
            "Thunderstruck"
          ],
          "Achievements": [
            "Joined AC/DC in 1977 and became a key part of the classic live era as bassist and harmony vocalist.",
            "Rock & Roll Hall of Fame inductee as a member of AC/DC (2003)."
          ],
          "ExternalLinks": {},
          "FullName": "Clifford Williams",
          "PrimaryInstruments": [
            "bass",
            "vocals"
          ],
          "Occupations": [
            "musician",
            "singer"
          ],
          "Genres": [
            "hard rock",
            "blues rock",
            "rock and roll"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Cliff Williams (birth details, joining AC/DC, retirement/return)",
              "Url": "https://en.wikipedia.org/wiki/Cliff_Williams",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: AC/DC (overview and current members)",
              "Url": "https://en.wikipedia.org/wiki/AC/DC",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Stevie Young",
        "Roles": [
          "rhythm guitar",
          "backing vocals"
        ],
        "Years": "2014–present (also filled in: 1988)",
        "Overview": "",
        "Bio": {
          "BioID": "acdc-stevie-young",
          "ArtistID": "acdc",
          "ArtistName": "AC/DC",
          "MemberName": "Stevie Young",
          "Biography": [
            "Stevie Young is Malcolm Young’s nephew and became AC/DC’s rhythm guitarist in 2014, stepping in as Malcolm retired due to illness. Because Malcolm’s rhythm style is so central to AC/DC’s identity, Stevie’s job has been less about reinvention and more about faithful continuity—keeping the band’s tight, percussive chord work intact.",
            "He had previously filled in for Malcolm during parts of the 1988 U.S. tour, giving him first‑hand familiarity with the band’s live demands. In the 2010s and 2020s he became the onstage partner to Angus Young, anchoring the riff patterns that define the songs.",
            "Stevie appears on late‑era recordings including *Rock or Bust* and *Power Up*, and has helped maintain AC/DC’s recognizable sound through a period of major transitions."
          ],
          "Birth": {
            "Date": "1956-12-11",
            "Place": "Glasgow, Scotland"
          },
          "ActiveYears": "1979–present",
          "AssociatedActs": [
            "AC/DC",
            "Starfighters"
          ],
          "KeyAlbums": [
            "Rock or Bust (2014)",
            "Power Up (2020)"
          ],
          "KeySongs": [
            "Shot in the Dark",
            "Realize"
          ],
          "Achievements": [
            "Replaced Malcolm Young on rhythm guitar beginning in 2014, helping carry the band’s classic rhythm style forward."
          ],
          "ExternalLinks": {},
          "FullName": "Stephen Crawford Young Jr.",
          "PrimaryInstruments": [
            "guitar"
          ],
          "Occupations": [
            "musician"
          ],
          "Genres": [
            "hard rock"
          ],
          "Sources": [
            {
              "Title": "Wikipedia: Stevie Young (joining AC/DC, replacing Malcolm)",
              "Url": "https://en.wikipedia.org/wiki/Stevie_Young",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Wikipedia: Power Up (personnel)",
              "Url": "https://en.wikipedia.org/wiki/Power_Up_(album)",
              "Accessed": "2025-12-31"
            }
          ]
        }
      }
    ],
    "NonCoreMembers": [
      {
        "Name": "Bon Scott",
        "Roles": [
          "lead vocals",
          "lyric writing (often credited in band histories)"
        ],
        "Years": "1974–1980",
        "Instruments": [
          "vocals"
        ],
        "Albums": [
          "High Voltage (1975)",
          "T.N.T. (1975)",
          "Dirty Deeds Done Dirt Cheap (1976)",
          "Let There Be Rock (1977)",
          "Powerage (1978)",
          "Highway to Hell (1979)"
        ],
        "Replacing": [
          "Dave Evans"
        ],
        "ReplacedBy": [
          "Brian Johnson"
        ],
        "Overview": "Bon Scott (Ronald Belford Scott) was the second lead vocalist of AC/DC and the frontman who carried the band from its early Australian years to international breakthrough. Joining in 1974, he paired a gritty voice with a mischievous, streetwise lyric style that gave songs an unmistakable swagger—equal parts humor, lust, and danger. Scott’s era produced foundational albums and stage anthems that defined AC/DC’s image, culminating in *Highway to Hell* (1979), their major U.S. breakthrough. He died in London on 19 February 1980 at age 33; the band decided to continue and recruited Brian Johnson, later honoring Scott’s memory as they moved into the *Back in Black* era."
      },
      {
        "Name": "Dave Evans",
        "Roles": [
          "lead vocals"
        ],
        "Years": "1973–1974",
        "Instruments": [
          "vocals"
        ],
        "Albums": [
          "\"Can I Sit Next to You, Girl\" (1974 single)"
        ],
        "Replacing": [],
        "ReplacedBy": [
          "Bon Scott"
        ],
        "Overview": "Dave Evans was AC/DC’s original lead singer during the band’s first months in Sydney, appearing on their earliest single “Can I Sit Next to You, Girl.” His tenure belongs to the pre‑breakthrough period when the Young brothers were still refining the band’s sound, stage identity, and long‑term lineup. Evans is part of AC/DC’s origin story—evidence of how quickly the group evolved before settling into the tougher, bluesier approach associated with Bon Scott. While he left before AC/DC’s first album run took shape, those early recordings and gigs mark the starting line of a band that would soon become one of rock’s biggest names."
      },
      {
        "Name": "Mark Evans",
        "Roles": [
          "bass guitar"
        ],
        "Years": "1975–1977",
        "Instruments": [
          "bass"
        ],
        "Albums": [
          "T.N.T. (1975)",
          "Dirty Deeds Done Dirt Cheap (1976)",
          "Let There Be Rock (1977)"
        ],
        "Replacing": [
          "Rob Bailey (touring/early period)",
          "various early bassists"
        ],
        "ReplacedBy": [
          "Cliff Williams"
        ],
        "Overview": "Mark Evans played bass for AC/DC during a crucial mid‑1970s stretch as the band’s lineup stabilized and their records began reaching beyond Australia. He appears on key releases including *Dirty Deeds Done Dirt Cheap* and *Let There Be Rock*, providing the driving, no‑frills low end that underpins the band’s riff‑first songwriting. Evans’s period also overlaps with the group’s growing reputation as a ferocious live act—tight, loud, and built around groove rather than ornament. After departing in 1977, his role was taken by Cliff Williams, whose backing vocals and long tenure would define the classic touring era."
      },
      {
        "Name": "Simon Wright",
        "Roles": [
          "drums",
          "percussion"
        ],
        "Years": "1983–1989",
        "Instruments": [
          "drums"
        ],
        "Albums": [
          "Fly on the Wall (1985)",
          "Who Made Who (1986)",
          "Blow Up Your Video (1988)"
        ],
        "Replacing": [
          "Phil Rudd"
        ],
        "ReplacedBy": [
          "Chris Slade"
        ],
        "Overview": "Simon Wright joined AC/DC in the 1980s after Phil Rudd’s departure, helping the band keep its rhythmic momentum through a decade of changing rock trends. He played on albums such as *Fly on the Wall* and *Blow Up Your Video*, bringing a firm, driving style that supported AC/DC’s commitment to straightforward riffs and big choruses. Wright’s era includes a heavy touring schedule and the band’s continued global visibility even when critical opinion was mixed. After leaving AC/DC, he built a prominent career elsewhere in hard rock and metal, but his AC/DC years remain a key part of the band’s 1980s chapter."
      },
      {
        "Name": "Chris Slade",
        "Roles": [
          "drums",
          "percussion"
        ],
        "Years": "1989–1994, 2015–2016",
        "Instruments": [
          "drums"
        ],
        "Albums": [
          "The Razors Edge (1990)",
          "\"Big Gun\" (1993)"
        ],
        "Replacing": [
          "Simon Wright",
          "Phil Rudd (later period)"
        ],
        "ReplacedBy": [
          "Phil Rudd",
          "touring drummers (various)"
        ],
        "Overview": "Chris Slade is best known in AC/DC history for his work on *The Razors Edge* (1990), the album that powered a major commercial resurgence and introduced “Thunderstruck.” His drumming is punchy and assertive, with a sharp attack and tight cymbal work that helped the band’s guitars land harder in arenas and on radio. Slade’s first stint covered the early ’90s peak, and he later returned during the mid‑2010s touring period, providing stability when the band’s lineup was in flux. Across both stretches, his contribution is tied to a simple message: AC/DC’s sound can survive transitions when the groove remains uncompromising."
      },
      {
        "Name": "Larry Van Kriedt",
        "Roles": [
          "bass guitar"
        ],
        "Years": "1973–1974",
        "Instruments": [
          "bass"
        ],
        "Albums": [],
        "Replacing": [],
        "ReplacedBy": [
          "early rotating bassists",
          "Rob Bailey (1974)"
        ],
        "Overview": "Larry Van Kriedt was AC/DC’s original bassist in the earliest 1973 lineup alongside Dave Evans, Malcolm Young, Angus Young, and drummer Colin Burgess. His time with the band came before the group’s first album releases, during a fast‑moving phase of personnel changes as the Young brothers searched for the right combination of players and stage presence. Van Kriedt’s importance is historical: he represents AC/DC at the moment of formation, when the band’s identity was still being built gig by gig. Although he didn’t remain for the classic recording era, his place in the initial lineup makes him part of the band’s foundational chapter."
      },
      {
        "Name": "Colin Burgess",
        "Roles": [
          "drums"
        ],
        "Years": "1973–1974",
        "Instruments": [
          "drums"
        ],
        "Albums": [],
        "Replacing": [],
        "ReplacedBy": [
          "early rotating drummers",
          "Phil Rudd (later classic era)"
        ],
        "Overview": "Colin Burgess was the drummer in AC/DC’s first lineup, playing at the very beginning of the band’s Sydney club history. Like several early members, his tenure was short, reflecting how quickly the Young brothers refined their lineup while building a reputation as a hard‑hitting live act. Burgess’s contribution sits in the “origin story” category: before chart success, before the iconic albums, there was the initial group learning what AC/DC could be onstage. Although later drummers would define the recorded sound, Burgess remains a notable early participant in the band’s formative months and earliest setlists, rehearsals, and club dates."
      }
    ],
    "Genres": [
      "Hard rock",
      "Blues rock",
      "Rock and roll (self-described)",
      "Heavy metal (often cited)"
    ],
    "Labels": [
      "Albert",
      "Atlantic",
      "ATCO",
      "East West",
      "Elektra",
      "Epic",
      "Columbia"
    ],
    "Overview": "AC/DC are an Australian rock band formed in Sydney in 1973 by brothers Malcolm and Angus Young. Built around stripped‑down riffs, blues‑rooted grooves, and a simple “rock and roll” ethos, the band became one of the defining stadium acts of the late 1970s and 1980s, known for relentless touring, a loud-and-lean sound, and Angus Young’s schoolboy‑uniform stage persona.\n\nAfter early Australian releases and international breakthroughs like *Let There Be Rock* (1977) and *Highway to Hell* (1979), the band endured a defining tragedy with the death of vocalist Bon Scott in February 1980. They regrouped with singer Brian Johnson and released *Back in Black* (1980), a landmark hard‑rock record and one of the best‑selling albums in music history. AC/DC were inducted into the Rock & Roll Hall of Fame in 2003 and, despite long gaps and lineup changes, have continued recording and touring into the 2020s.",
    "NotableAlbums": [
      {
        "Title": "High Voltage",
        "Year": 1975,
        "Notes": "Early breakthrough in Australia; introduced the band’s core template."
      },
      {
        "Title": "Let There Be Rock",
        "Year": 1977,
        "Notes": "Harder, faster statement that cemented their riff-driven identity."
      },
      {
        "Title": "Highway to Hell",
        "Year": 1979,
        "Notes": "International breakthrough and the final studio album with Bon Scott."
      },
      {
        "Title": "Back in Black",
        "Year": 1980,
        "Notes": "First album with Brian Johnson; a defining hard-rock release and global blockbuster."
      },
      {
        "Title": "For Those About to Rock (We Salute You)",
        "Year": 1981,
        "Notes": "Major early-’80s peak; famed for its cannon-fire stage show."
      },
      {
        "Title": "The Razors Edge",
        "Year": 1990,
        "Notes": "Commercial resurgence anchored by “Thunderstruck.”"
      },
      {
        "Title": "Black Ice",
        "Year": 2008,
        "Notes": "Late-career No. 1 comeback that launched a massive world tour."
      },
      {
        "Title": "Power Up",
        "Year": 2020,
        "Notes": "Return of Johnson, Rudd, and Williams for a tribute-tinged late-era album."
      }
    ],
    "SignatureSongs": [
      "Highway to Hell",
      "Back in Black",
      "Hells Bells",
      "You Shook Me All Night Long",
      "T.N.T.",
      "Whole Lotta Rosie",
      "For Those About to Rock (We Salute You)",
      "Thunderstruck",
      "Shoot to Thrill"
    ],
    "Achievements": [
      "Inducted into the Rock & Roll Hall of Fame (2003).",
      "*Back in Black* became one of the best-selling albums in history and a defining hard-rock record.",
      "Decades-long stadium touring reputation and enduring catalog dominance across rock radio and streaming."
    ],
    "KeyFacts": [
      "Formed in Sydney in 1973 by brothers Malcolm and Angus Young.",
      "The band describes its style as “rock and roll” even as critics often classify them as hard rock or heavy metal.",
      "Known for high-energy live shows, including Angus Young’s schoolboy uniform and (on some tours) cannon effects during “For Those About to Rock.”"
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.acdc.com/",
      "RockHall": "https://rockhall.com/inductees/acdc/",
      "Britannica": "https://www.britannica.com/topic/AC-DC",
      "Wikipedia": "https://en.wikipedia.org/wiki/AC/DC"
    }
  },
  {
    "ArtistID": "aerosmith",
    "Name": "Aerosmith",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "america",
    "Type": "Band",
    "Origin": {
      "City": "London",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "YearsActive": [
      "1970–present"
    ],
    "Genres": [
      "soft rock",
      "folk rock",
      "pop rock",
      "country rock"
    ],
    "Labels": [
      "Warner Bros.",
      "Capitol",
      "Burgundy"
    ],
    "Overview": "America is a British‑American rock band formed in London in 1970 by Gerry Beckley, Dewey Bunnell, and Dan Peek—three American teenagers who met at London Central High School while their fathers were stationed in the U.K. with the U.S. Air Force. Built around acoustic guitars and close three‑part harmonies, the trio became one of the defining soft‑rock voices of the early 1970s, blending folk‑rock storytelling with pop craft.\n\nTheir self‑titled debut and the breakthrough single “A Horse with No Name” launched a run of radio staples including “I Need You,” “Ventura Highway,” “Tin Man,” “Lonely People,” “Sister Golden Hair,” and “Daisy Jane.” Peek departed in 1977, and Beckley and Bunnell continued as a duo while keeping America active through later decades, including the early‑’80s Top 10 hit “You Can Do Magic.”\n\nOver a long touring and recording career, America’s catalog has remained a cornerstone of classic rock and adult‑contemporary playlists, recognized with a GRAMMY win for Best New Artist and other industry honors. In the mid‑2020s the group continued touring with Dewey Bunnell at the helm, while Gerry Beckley stepped back from touring in 2024 but remained a member of the band.",
    "NotableAlbums": [
      {
        "Title": "America",
        "Year": 1972,
        "Notes": "Debut album featuring “A Horse with No Name,” “I Need You,” and “Sandman.”"
      },
      {
        "Title": "Homecoming",
        "Year": 1972,
        "Notes": "Second album anchored by “Ventura Highway” and a fuller band sound."
      },
      {
        "Title": "Holiday",
        "Year": 1974,
        "Notes": "Produced by George Martin; includes “Tin Man” and “Lonely People.”"
      },
      {
        "Title": "Hearts",
        "Year": 1975,
        "Notes": "Features “Sister Golden Hair” and “Daisy Jane,” a peak‑era hit set."
      },
      {
        "Title": "History: America's Greatest Hits",
        "Year": 1975,
        "Notes": "Signature compilation; multi‑platinum and a key entry point for new listeners."
      },
      {
        "Title": "View from the Ground",
        "Year": 1982,
        "Notes": "Return to major chart success with “You Can Do Magic.”"
      }
    ],
    "SignatureSongs": [
      "A Horse with No Name",
      "I Need You",
      "Ventura Highway",
      "Tin Man",
      "Lonely People",
      "Sister Golden Hair",
      "Daisy Jane",
      "You Can Do Magic",
      "The Border"
    ],
    "Achievements": [
      {
        "Type": "GRAMMY Awards",
        "Year": 1973,
        "Detail": "Won Best New Artist and received additional nominations at the 15th Annual GRAMMY Awards."
      },
      {
        "Type": "Vocal Group Hall of Fame",
        "Year": 2006,
        "Detail": "Inducted for their long‑running impact as a harmony‑driven vocal group."
      },
      {
        "Type": "Hollywood Walk of Fame",
        "Year": 2012,
        "Detail": "Received a star recognizing their enduring cultural and commercial presence."
      }
    ],
    "KeyFacts": [
      "Formed in London in 1970 by Gerry Beckley, Dewey Bunnell, and Dan Peek.",
      "Breakthrough hit “A Horse with No Name” became an international signature song.",
      "Dan Peek left in 1977; Beckley and Bunnell continued America as a touring and recording act.",
      "Gerry Beckley retired from touring in 2024 but remained a member; Dewey Bunnell continued touring under the America name."
    ],
    "ExternalLinks": {
      "OfficialSite": "https://venturahighway.com/",
      "AllMusic": "https://www.allmusic.com/artist/america-mn0000019297",
      "Grammy": "https://www.grammy.com/artists/america/7616",
      "Wikipedia": "https://en.wikipedia.org/wiki/America_(band)",
      "Discogs": "https://www.discogs.com/artist/58374-America"
    },
    "CoreMembers": [
      {
        "Name": "Gerry Beckley",
        "Roles": [
          "lead and backing vocals",
          "guitars",
          "keyboards",
          "bass",
          "harmonica"
        ],
        "Years": "1970–present (not touring since 2024)",
        "Overview": "Co‑founder and primary songwriter/singer whose melodic sensibility helped define America’s sound.",
        "Bio": {
          "BioID": "america-gerry-beckley",
          "ArtistID": "america",
          "ArtistName": "America",
          "MemberName": "Gerry Beckley",
          "Biography": [
            "Gerry Beckley (Gerald Linford Beckley) is a founding member of America and one of the band’s principal voices, known for a clear, pop‑leaning melodic style and a songwriter’s attention to detail. Raised between the U.S. and the U.K., he began playing music young and was writing and performing well before America formed.",
            "In London, Beckley met Dewey Bunnell and Dan Peek at London Central High School and the trio shaped an acoustic‑driven harmony sound that became America’s calling card. Beckley contributed key songs and lead vocals across the classic era and helped steer the band through multiple phases as tastes changed from the 1970s into later decades.",
            "Beyond America, he built a parallel solo career with albums that lean into intimate pop and acoustic songwriting, often revisiting themes of travel, memory, and romantic clarity. His solo work also highlights his multi‑instrumental approach and arranging instincts.",
            "After more than five decades of touring, Beckley announced his retirement from touring in 2024, while remaining a member of America and continuing to write and record. His legacy is tied to the band’s signature blend of harmony, restraint, and instantly recognizable melodic hooks."
          ],
          "Birth": {
            "Date": "1952-09-12",
            "Place": "Fort Worth, Texas, U.S."
          },
          "Death": null,
          "ActiveYears": "1967–present",
          "AssociatedActs": [
            "America"
          ],
          "KeyAlbums": [
            "America (1972)",
            "Holiday (1974)",
            "Hearts (1975)",
            "History: America's Greatest Hits (1975)",
            "View from the Ground (1982)"
          ],
          "KeySongs": [
            "I Need You",
            "Sister Golden Hair",
            "A Horse with No Name (band breakthrough era)",
            "You Can Do Magic (band later-era hit)"
          ],
          "Achievements": [
            "Founding member of America; part of the band’s GRAMMY win for Best New Artist (1973).",
            "Continued as a core creative voice through America’s long-running touring and recording history.",
            "Retired from touring in 2024 while remaining a member and continuing studio and songwriting work."
          ],
          "ExternalLinks": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Gerry_Beckley",
            "OfficialBandSite": "https://venturahighway.com/",
            "GrammyArtist": "https://www.grammy.com/artists/america/7616"
          },
          "FullName": "Gerald Linford Beckley",
          "PrimaryInstruments": [
            "vocals",
            "guitar",
            "keyboards",
            "bass",
            "harmonica"
          ],
          "Occupations": [
            "singer-songwriter",
            "musician"
          ],
          "Genres": [
            "rock",
            "soft rock",
            "folk rock",
            "pop rock"
          ],
          "Sources": [
            {
              "Title": "America (band) — Personnel / overview",
              "Url": "https://en.wikipedia.org/wiki/America_(band)",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Gerry Beckley — biography",
              "Url": "https://en.wikipedia.org/wiki/Gerry_Beckley",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "America — Official site (news/bio)",
              "Url": "https://venturahighway.com/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "America — GRAMMY artist page",
              "Url": "https://www.grammy.com/artists/america/7616",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Dewey Bunnell",
        "Roles": [
          "lead and backing vocals",
          "guitars",
          "percussion"
        ],
        "Years": "1970–present",
        "Overview": "Co‑founder and primary songwriter behind multiple signature hits, including “A Horse with No Name.”",
        "Bio": {
          "BioID": "america-dewey-bunnell",
          "ArtistID": "america",
          "ArtistName": "America",
          "MemberName": "Dewey Bunnell",
          "Biography": [
            "Dewey Bunnell (Lee Merton Bunnell) is a founding member of America and a defining songwriter of the band’s early run, widely associated with the warm, acoustic‑driven sound and lyrical imagery that made the group a radio staple. Born in England to an American serviceman family, he came of age moving between places—an experience that shows up in the travel‑tinged atmospheres of many America songs.",
            "Bunnell met Gerry Beckley and Dan Peek at London Central High School and the trio formed America in London in 1970, developing close three‑part harmonies and a folk‑rock approach that translated quickly to major-label success. He wrote and sang lead on several of the band’s best-known tracks, including “A Horse with No Name,” as well as other era‑defining hits like “Ventura Highway” and “Tin Man.”",
            "When Dan Peek left in 1977, Bunnell continued with Beckley, keeping America active through changing musical climates while preserving the group’s core identity: melodic restraint, vocal blend, and a uniquely gentle sense of groove. He remained a steady stage presence as touring became the band’s long‑term anchor.",
            "In the 2020s, Bunnell continued touring under the America name, supported by a rotating lineup of touring musicians. As the sole founding member consistently on the road after Beckley’s 2024 touring retirement, he became the on‑stage continuity link to the original trio era while maintaining the group’s signature sound."
          ],
          "Birth": {
            "Date": "1952-01-19",
            "Place": "Harrogate, Yorkshire, England"
          },
          "Death": null,
          "ActiveYears": "1969–present",
          "AssociatedActs": [
            "America"
          ],
          "KeyAlbums": [
            "America (1972)",
            "Homecoming (1972)",
            "Holiday (1974)",
            "Hearts (1975)",
            "View from the Ground (1982)"
          ],
          "KeySongs": [
            "A Horse with No Name",
            "Ventura Highway",
            "Tin Man",
            "The Border"
          ],
          "Achievements": [
            "Founding member of America; part of the band’s GRAMMY win for Best New Artist (1973).",
            "Writer of multiple signature songs that define America’s 1970s catalog and enduring airplay.",
            "Continued touring leadership into the mid‑2020s as America’s live frontman."
          ],
          "ExternalLinks": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Dewey_Bunnell",
            "OfficialBandSite": "https://venturahighway.com/",
            "GrammyArtist": "https://www.grammy.com/artists/america/7616"
          },
          "FullName": "Lee Merton Bunnell",
          "PrimaryInstruments": [
            "vocals",
            "guitar",
            "percussion"
          ],
          "Occupations": [
            "musician",
            "singer-songwriter"
          ],
          "Genres": [
            "rock",
            "soft rock",
            "folk rock"
          ],
          "Sources": [
            {
              "Title": "America (band) — Personnel / overview",
              "Url": "https://en.wikipedia.org/wiki/America_(band)",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Dewey Bunnell — biography",
              "Url": "https://en.wikipedia.org/wiki/Dewey_Bunnell",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "America — Official site (news/bio)",
              "Url": "https://venturahighway.com/",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "America — GRAMMY artist page",
              "Url": "https://www.grammy.com/artists/america/7616",
              "Accessed": "2025-12-31"
            }
          ]
        }
      },
      {
        "Name": "Dan Peek",
        "Roles": [
          "lead and backing vocals",
          "guitars",
          "bass",
          "keyboards",
          "harmonica"
        ],
        "Years": "1970–1977 (died 2011)",
        "Overview": "Co‑founder whose vocal blend and songwriting helped define America’s classic trio era before his 1977 departure.",
        "Bio": {
          "BioID": "america-dan-peek",
          "ArtistID": "america",
          "ArtistName": "America",
          "MemberName": "Dan Peek",
          "Biography": [
            "Dan Peek (Daniel Milton Peek) co‑founded America with Gerry Beckley and Dewey Bunnell, providing harmony vocals, multi‑instrumental support, and songwriting during the group’s breakthrough years. Born in Florida in an Air Force family, he—like the other founding members—came up as an American teenager living in England.",
            "Peek met Beckley and Bunnell at London Central High School and joined the band that became America in 1970. During the trio era, he contributed songs and vocals on albums that established the band’s soft‑rock identity, including work associated with staples like “Lonely People” and the classic early‑’70s catalog.",
            "In 1977, Peek left America and later pursued a solo path that included work in contemporary Christian music, becoming known for faith‑centered songwriting and recording. His departure marked a major shift in the band’s internal chemistry, with America continuing as a duo in subsequent decades.",
            "Peek died in 2011 at age 60, closing the door on long‑running reunion speculation. His place in America’s history remains tied to the original harmony‑driven trio sound and the early period that defined the group’s public identity."
          ],
          "Birth": {
            "Date": "1950-11-01",
            "Place": "Panama City, Florida, U.S."
          },
          "Death": {
            "Date": "2011-07-24",
            "Place": "Farmington, Missouri, U.S."
          },
          "ActiveYears": "1969–2011",
          "AssociatedActs": [
            "America"
          ],
          "KeyAlbums": [
            "America (1972)",
            "Homecoming (1972)",
            "Holiday (1974)",
            "Hearts (1975)"
          ],
          "KeySongs": [
            "Lonely People",
            "Muskrat Love (band era)",
            "America (classic trio harmonies)"
          ],
          "Achievements": [
            "Founding member of America during the band’s GRAMMY‑winning breakthrough period.",
            "Key part of the original trio’s harmony blend and multi‑instrumental arrangements.",
            "Later recognized for a solo career that shifted toward contemporary Christian music."
          ],
          "ExternalLinks": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Dan_Peek",
            "OfficialBandSite": "https://venturahighway.com/",
            "AllMusicArtist": "https://www.allmusic.com/artist/dan-peek-mn0000953589"
          },
          "FullName": "Daniel Milton Peek",
          "PrimaryInstruments": [
            "vocals",
            "guitars",
            "bass",
            "keyboards",
            "harmonica"
          ],
          "Occupations": [
            "musician",
            "singer-songwriter"
          ],
          "Genres": [
            "folk rock",
            "soft rock",
            "country rock",
            "contemporary Christian"
          ],
          "Sources": [
            {
              "Title": "America (band) — Personnel / overview",
              "Url": "https://en.wikipedia.org/wiki/America_(band)",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Dan Peek — biography",
              "Url": "https://en.wikipedia.org/wiki/Dan_Peek",
              "Accessed": "2025-12-31"
            },
            {
              "Title": "Dan Peek — AllMusic artist page",
              "Url": "https://www.allmusic.com/artist/dan-peek-mn0000953589",
              "Accessed": "2025-12-31"
            }
          ]
        }
      }
    ],
    "NonCoreMembers": [
      {
        "Name": "Richard Campbell",
        "Roles": [
          "bass",
          "vocals"
        ],
        "Years": "2003–present",
        "Instruments": [
          "bass"
        ],
        "Albums": [
          "(touring lineup)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Richard Campbell is America’s long‑serving touring bassist and harmony vocalist, joining the road band in the early 2000s and becoming a key part of the modern live sound. In performance, he supports the classic acoustic‑and‑harmony identity with a steadier, fuller low end, while also adding backing vocals that help recreate the multi‑part blend that defined the original trio era. As the group’s touring lineup evolved—especially in the mid‑2020s, when Dewey Bunnell continued touring at the helm—Campbell’s role provided continuity, locking in grooves across both ’70s staples and later‑era hits. His presence is especially important in a show built around recognizable melodies and tight vocal balance, where subtle dynamics and clean arrangements matter as much as flash."
      },
      {
        "Name": "Ryland Steen",
        "Roles": [
          "drums",
          "percussion",
          "backing vocals"
        ],
        "Years": "2014–present",
        "Instruments": [
          "drums",
          "percussion"
        ],
        "Albums": [
          "(touring lineup)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Ryland Steen is the band’s touring drummer and percussionist in the modern era, joining the live lineup in the 2010s and helping keep America’s songs feeling light, clear, and song‑first. Because much of America’s best‑known material relies on acoustic textures and vocal blend, his drumming emphasizes pocket, restraint, and clean transitions rather than heavy fills—supporting the melodies without crowding them. On stage he also contributes backing vocals, a practical necessity for maintaining the layered harmony sound in a smaller touring ensemble. In the post‑trio and post‑duo‑touring period, his steady feel helps unify the set across decades, from early ’70s hits to later chart returns."
      },
      {
        "Name": "Steve Fekete",
        "Roles": [
          "guitars",
          "keyboards",
          "backing vocals"
        ],
        "Years": "2018–present",
        "Instruments": [
          "guitar",
          "keyboards"
        ],
        "Albums": [
          "(touring lineup)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Steve Fekete is a key member of America’s current touring band, covering guitars and keyboards while also supporting the vocal blend. His role is partly orchestration: translating studio layers—acoustic strums, electric accents, and keyboard color—into a cohesive live arrangement that still feels airy and familiar. He helps preserve the characteristic “wide” America sound even when the stage lineup shifts, handling harmonic textures that keep choruses buoyant and recognizable. In a catalog where subtle tone and balance are central, his ability to move between rhythm support and melodic details is a practical backbone for the live show."
      },
      {
        "Name": "Andy Barr",
        "Roles": [
          "guitars",
          "banjo",
          "keyboards",
          "lead and backing vocals"
        ],
        "Years": "2016–2018, 2024–present",
        "Instruments": [
          "guitar",
          "banjo",
          "keyboards"
        ],
        "Albums": [
          "(touring lineup)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Andy Barr is a touring multi‑instrumentalist and singer who has served in America’s live lineup across multiple stints, contributing guitars, keyboards, and banjo as needed. He also adds lead and backing vocals—an especially valuable skill for a band whose identity is built around harmony and clean melodic interplay. In the mid‑2020s, as the touring configuration adjusted around Dewey Bunnell’s continuing road leadership, Barr’s versatility helped keep arrangements flexible without losing the recognizable character of the songs. His job is as much about tone‑matching and balance as it is about parts: reinforcing the acoustic foundation while adding color where the recordings call for it."
      },
      {
        "Name": "David Dickey",
        "Roles": [
          "bass",
          "backing vocals"
        ],
        "Years": "1972–1980 (died 2016)",
        "Instruments": [
          "bass"
        ],
        "Albums": [
          "(touring lineup, classic era)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "David Dickey was America’s early touring bassist, joining as the group expanded from an acoustic trio into a fuller live band during the 1970s. In that period, the challenge was translating delicate acoustic songs and tight vocal harmonies into rooms that demanded more volume and rhythmic weight. Dickey’s bass work anchored that transition, giving the band the low‑end support it needed for larger stages while still staying out of the way of the vocal blend. He also provided backing vocals, reinforcing the harmony texture that defined America’s public sound. His long run across much of the classic decade made him one of the most significant supporting musicians in the band’s touring history."
      },
      {
        "Name": "Willie Leacox",
        "Roles": [
          "drums",
          "percussion"
        ],
        "Years": "1973–2014 (died 2022)",
        "Instruments": [
          "drums",
          "percussion"
        ],
        "Albums": [
          "(touring lineup)"
        ],
        "Replacing": [],
        "ReplacedBy": [],
        "Overview": "Willie Leacox was America’s longtime touring drummer, joining in the early 1970s and remaining a central figure in the live band for decades. His approach supported America’s signature feel—a mix of gentle propulsion and careful dynamics that left space for acoustic guitars and three‑part harmony. In a catalog where the groove is often understated, consistency and touch are critical, and Leacox’s steadiness helped audiences hear the songs the way they remembered them. His tenure spanned multiple eras of the band’s career, making him a defining behind‑the‑scenes contributor to how America sounded on stage for generations of concertgoers."
      },
      {
        "Name": "Calvin \"Fuzzy\" Samuels",
        "Roles": [
          "bass"
        ],
        "Years": "1974 (substitute)",
        "Instruments": [
          "bass"
        ],
        "Albums": [
          "(touring substitute)"
        ],
        "Replacing": [
          "David Dickey (temporary fill‑in)"
        ],
        "ReplacedBy": [
          "David Dickey (return)"
        ],
        "Overview": "Calvin “Fuzzy” Samuels is a notable fill‑in bassist in America’s touring history, stepping in during a 1974 stretch when the band needed a substitute for their regular touring bassist. Though short‑term, the assignment mattered because it occurred during a high‑visibility period as America continued building momentum beyond their initial breakthrough. A bassist in this context has to be both precise and tasteful—reinforcing harmonic movement without disrupting the delicate acoustic‑and‑vocal balance. Samuels’ professional background and adaptability made him a practical solution for keeping the live show smooth during a transitional moment."
      }
    ],
    "Name": "America"
  },
  {
    "ArtistID": "the-allman-brothers-band",
    "Name": "The Allman Brothers Band",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-animals",
    "Name": "The Animals",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "asia",
    "Name": "Asia",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "bad-company",
    "Name": "Bad Company",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "badfinger",
    "Name": "Badfinger",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "bachman-turner-overdrive",
    "Name": "Bachman-Turner Overdrive",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-band",
    "Name": "The Band",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-beach-boys",
    "Name": "The Beach Boys",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "big-brother-and-the-holding-company",
    "Name": "Big Brother and the Holding Company",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "billy-joel",
    "Name": "Billy Joel",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "black-sabbath",
    "Name": "Black Sabbath",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "blondie",
    "Name": "Blondie",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "blue-oyster-cult",
    "Name": "Blue Öyster Cult",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "bob-dylan",
    "Name": "Bob Dylan",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "boston",
    "Name": "Boston",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "bread",
    "Name": "Bread",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "bruce-springsteen",
    "Name": "Bruce Springsteen",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "buffalo-springfield",
    "Name": "Buffalo Springfield",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-byrds",
    "Name": "The Byrds",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-cars",
    "Name": "The Cars",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "cat-stevens",
    "Name": "Cat Stevens",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "cheap-trick",
    "Name": "Cheap Trick",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "chicago",
    "Name": "Chicago",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-clash",
    "Name": "The Clash",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "cream",
    "Name": "Cream",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "creedence-clearwater-revival",
    "Name": "Creedence Clearwater Revival",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "crosby-stills-nash-young",
    "Name": "Crosby, Stills, Nash & Young",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "david-bowie",
    "Name": "David Bowie",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "deep-purple",
    "Name": "Deep Purple",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "def-leppard",
    "Name": "Def Leppard",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "derek-and-the-dominos",
    "Name": "Derek and the Dominos",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "dire-straits",
    "Name": "Dire Straits",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-doobie-brothers",
    "Name": "The Doobie Brothers",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-doors",
    "Name": "The Doors",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "electric-light-orchestra",
    "Name": "Electric Light Orchestra",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "eagles",
    "Name": "Eagles",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "emerson-lake-palmer",
    "Name": "Emerson, Lake & Palmer",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "eric-clapton",
    "Name": "Eric Clapton",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "fleetwood-mac",
    "Name": "Fleetwood Mac",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "foreigner",
    "Name": "Foreigner",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "frank-zappa",
    "Name": "Frank Zappa",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "genesis",
    "Name": "Genesis",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "golden-earring",
    "Name": "Golden Earring",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "grand-funk-railroad",
    "Name": "Grand Funk Railroad",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "grateful-dead",
    "Name": "Grateful Dead",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "heart",
    "Name": "Heart",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "iron-maiden",
    "Name": "Iron Maiden",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "jackson-browne",
    "Name": "Jackson Browne",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "james-taylor",
    "Name": "James Taylor",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "janis-joplin",
    "Name": "Janis Joplin",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "jefferson-airplane",
    "Name": "Jefferson Airplane",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "jethro-tull",
    "Name": "Jethro Tull",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "jimi-hendrix",
    "Name": "Jimi Hendrix",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "journey",
    "Name": "Journey",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "judas-priest",
    "Name": "Judas Priest",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "kansas",
    "Name": "Kansas",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "king-crimson",
    "Name": "King Crimson",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "kiss",
    "Name": "Kiss",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-kinks",
    "Name": "The Kinks",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "led-zeppelin",
    "Name": "Led Zeppelin",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "little-feat",
    "Name": "Little Feat",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "lynyrd-skynyrd",
    "Name": "Lynyrd Skynyrd",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "meat-loaf",
    "Name": "Meat Loaf",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-moody-blues",
    "Name": "The Moody Blues",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "motorhead",
    "Name": "Motörhead",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "mountain",
    "Name": "Mountain",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "nazareth",
    "Name": "Nazareth",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "neil-young",
    "Name": "Neil Young",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-police",
    "Name": "The Police",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-pretenders",
    "Name": "The Pretenders",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "queen",
    "Name": "Queen",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "rainbow",
    "Name": "Rainbow",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "ramones",
    "Name": "Ramones",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "r-e-m",
    "Name": "R.E.M.",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "reo-speedwagon",
    "Name": "REO Speedwagon",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "rod-stewart",
    "Name": "Rod Stewart",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "roxy-music",
    "Name": "Roxy Music",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "rush",
    "Name": "Rush",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "santana",
    "Name": "Santana",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "scorpions",
    "Name": "Scorpions",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "sex-pistols",
    "Name": "Sex Pistols",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "simon-garfunkel",
    "Name": "Simon & Garfunkel",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "steely-dan",
    "Name": "Steely Dan",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "steve-miller-band",
    "Name": "Steve Miller Band",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "steppenwolf",
    "Name": "Steppenwolf",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "styx",
    "Name": "Styx",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "supertramp",
    "Name": "Supertramp",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "t-rex",
    "Name": "T. Rex",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "talking-heads",
    "Name": "Talking Heads",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "thin-lizzy",
    "Name": "Thin Lizzy",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "tom-petty-and-the-heartbreakers",
    "Name": "Tom Petty and the Heartbreakers",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "van-halen",
    "Name": "Van Halen",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "the-who",
    "Name": "The Who",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "yes",
    "Name": "Yes",
    "CoreMembers": [],
    "NonCoreMembers": []
  },
  {
    "ArtistID": "zz-top",
    "Name": "ZZ Top",
    "CoreMembers": [],
    "NonCoreMembers": []
  }
]
