[
  {
    "BioID": "john-lennon__the-beatles",
    "ArtistID": "the-beatles",
    "ArtistName": "The Beatles",
    "MemberName": "John Lennon",
    "Biography": [
      "John Lennon (9 October 1940 – 8 December 1980) was a Liverpool-born songwriter, singer, and artist who became one of the central figures in 20th‑century popular music as a co-founder of the Beatles.",
      "As a teenager he formed a skiffle group that evolved into the Quarrymen; Paul McCartney joined soon after, and Lennon and McCartney became the band’s core songwriting partnership as the group developed into the Beatles.",
      "With the Beatles, Lennon helped drive the band’s early rock-and-roll sound and later its studio experimentation, writing or co-writing songs that ranged from direct pop singles to more personal and politically charged work. His vocal style and lyrical voice—alternately biting, vulnerable, and surreal—became one of the group’s signatures.",
      "By the late 1960s Lennon’s personal and artistic life was increasingly entwined with Yoko Ono, with whom he pursued avant‑garde projects and highly visible peace activism. Their public campaigns made Lennon a prominent cultural and political figure beyond music.",
      "After the Beatles’ breakup, Lennon launched a major solo career that included the starkly confessional album John Lennon/Plastic Ono Band (1970) and the internationally popular Imagine (1971). His solo catalog also included collaborations and projects that reflected his interest in social issues and experimental art.",
      "In the early 1970s Lennon relocated to New York City and became active in U.S. political and cultural life, a period that also brought him into conflict with U.S. immigration authorities. He continued recording through the decade and remained a major public presence even as his output became more intermittent.",
      "In 1980 Lennon returned to recording with the album Double Fantasy, released shortly before he was shot and killed in New York City. His death prompted worldwide mourning and cemented his status as an emblematic figure of the 1960s and its aftershocks.",
      "Lennon’s work with the Beatles and as a solo artist continues to shape songwriting, recording aesthetics, and popular culture. The Beatles were inducted into the Rock & Roll Hall of Fame in 1988, and Lennon was inducted as a solo performer in 1994."
    ],
    "Birth": {
      "Date": "1940-10-09",
      "City": "Liverpool",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "1980-12-08",
      "City": "New York City",
      "Region": "New York",
      "Country": "United States"
    },
    "ActiveYears": [
      "1956–1980"
    ],
    "AssociatedActs": [
      "The Quarrymen",
      "The Beatles",
      "Plastic Ono Band",
      "The Dirty Mac"
    ],
    "KeyAlbums": [
      {
        "Title": "John Lennon/Plastic Ono Band",
        "Year": 1970,
        "Notes": "A stark, influential solo statement rooted in confession and minimalism."
      },
      {
        "Title": "Imagine",
        "Year": 1971,
        "Notes": "His best-known solo album, balancing political edge with pop accessibility."
      },
      {
        "Title": "Double Fantasy",
        "Year": 1980,
        "Notes": "A late-career collaboration/parallel statement with Yoko Ono, released shortly before his death."
      }
    ],
    "KeySongs": [
      "Imagine",
      "Instant Karma!",
      "Working Class Hero",
      "Give Peace a Chance",
      "#9 Dream"
    ],
    "Achievements": [
      {
        "Type": "Rock & Roll Hall of Fame (solo)",
        "Year": 1994,
        "Detail": "Inducted as a solo performer."
      }
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.johnlennon.com/",
      "AllMusic": "https://www.allmusic.com/artist/john-lennon-mn0000232564",
      "RockHall": "https://rockhall.com/inductees/john-lennon/",
      "Wikipedia": "https://en.wikipedia.org/wiki/John_Lennon",
      "Discogs": "https://www.discogs.com/artist/46439-John-Lennon"
    }
  },
  {
    "BioID": "paul-mccartney__the-beatles",
    "ArtistID": "the-beatles",
    "ArtistName": "The Beatles",
    "MemberName": "Paul McCartney",
    "Biography": [
      "Paul McCartney (born 18 June 1942) is a singer, songwriter, and multi‑instrumentalist whose melodic approach and wide stylistic range helped define the Beatles’ music and later sustained one of the most durable post‑1960s careers in popular music.",
      "Growing up in Liverpool, he met John Lennon as a teenager and joined Lennon’s group, which evolved into the Beatles. McCartney and Lennon formed an unusually prolific songwriting partnership that became the band’s creative engine, shaping its early rock-and-roll sound and its later studio innovations.",
      "In the Beatles, McCartney contributed landmark songs across the band’s full arc—from early singles to the increasingly ambitious albums of the mid‑ and late‑1960s—while also becoming one of rock’s most influential bass players and arrangers. His interest in composition and recording technique broadened the band’s palette toward orchestration, collage, and genre-blending.",
      "After the Beatles split, McCartney released solo work and soon formed Wings with Linda McCartney and other musicians, building one of the most commercially successful touring and recording acts of the 1970s. Wings and McCartney’s solo catalog expanded his songwriting into radio pop, hard rock, ballads, and more experimental material.",
      "From the 1980s onward he continued releasing studio albums, collaborating widely, and maintaining an active touring schedule that kept Beatles material in dialogue with new work. His output has also included projects in classical composition and film scoring alongside mainstream rock releases.",
      "McCartney has received numerous honors recognizing both his work with the Beatles and his solo achievements. The Beatles were inducted into the Rock & Roll Hall of Fame in 1988; McCartney was inducted as a solo performer in 1999, and he was knighted in 1997 for services to music."
    ],
    "Birth": {
      "Date": "1942-06-18",
      "City": "Liverpool",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "",
      "City": "",
      "Region": "",
      "Country": ""
    },
    "ActiveYears": [
      "1957–present"
    ],
    "AssociatedActs": [
      "The Quarrymen",
      "The Beatles",
      "Wings",
      "The Fireman"
    ],
    "KeyAlbums": [
      {
        "Title": "Band on the Run",
        "Year": 1973,
        "Notes": "A defining Wings album and a cornerstone of his post-Beatles catalog."
      },
      {
        "Title": "Ram",
        "Year": 1971,
        "Notes": "A home‑studio‑leaning solo statement later hailed for its inventive pop craft."
      },
      {
        "Title": "McCartney",
        "Year": 1970,
        "Notes": "A self-contained early solo record that set the template for DIY pop-rock."
      }
    ],
    "KeySongs": [
      "Maybe I’m Amazed",
      "Live and Let Die",
      "Band on the Run",
      "Let It Be",
      "Hey Jude"
    ],
    "Achievements": [
      {
        "Type": "Rock & Roll Hall of Fame (solo)",
        "Year": 1999,
        "Detail": "Inducted as a solo performer."
      }
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.paulmccartney.com/",
      "AllMusic": "https://www.allmusic.com/artist/paul-mccartney-mn0000029884",
      "RockHall": "https://rockhall.com/inductees/paul-mccartney/",
      "Wikipedia": "https://en.wikipedia.org/wiki/Paul_McCartney",
      "Discogs": "https://www.discogs.com/artist/35301-Paul-McCartney"
    }
  },
  {
    "BioID": "george-harrison__the-beatles",
    "ArtistID": "the-beatles",
    "ArtistName": "The Beatles",
    "MemberName": "George Harrison",
    "Biography": [
      "George Harrison (25 February 1943 – 29 November 2001) was the Beatles’ lead guitarist and a songwriter whose work grew from early contributions into some of the band’s most celebrated late‑period songs.",
      "Born in Liverpool, Harrison joined the group that became the Beatles while still a teenager, completing the classic lineup with Lennon, McCartney, and drummer Ringo Starr. Within the band he developed a distinctive guitar voice and an expanding interest in harmony, texture, and arrangement.",
      "Harrison began contributing original songs early in the Beatles’ career and later wrote widely admired pieces including “While My Guitar Gently Weeps,” “Something,” and “Here Comes the Sun.” His writing often brought a more introspective and melodic counterweight to the Lennon–McCartney dominance of the catalog.",
      "In the mid‑1960s Harrison became deeply engaged with Indian music and spirituality. He studied sitar with Ravi Shankar and introduced these sounds to a mass Western audience, notably on the Beatles’ recordings, and later made transcendental meditation a lasting part of his life.",
      "Following the Beatles’ breakup, Harrison achieved major solo success, including the highly successful triple album All Things Must Pass (1970) and hit recordings such as “My Sweet Lord.” He also organized high‑profile benefit concerts for Bangladesh in 1971, helping establish the modern template for large-scale, star‑driven charity events.",
      "Beyond music, Harrison co-founded Handmade Films in 1979 and supported projects that included notable British productions. In the late 1980s he also recorded and performed with the supergroup the Traveling Wilburys alongside Bob Dylan, Roy Orbison, Tom Petty, and Jeff Lynne.",
      "Harrison’s legacy is strongly tied to his role in widening rock’s musical and spiritual influences. The Beatles were inducted into the Rock & Roll Hall of Fame in 1988, and Harrison was inducted as a solo performer in 2004."
    ],
    "Birth": {
      "Date": "1943-02-25",
      "City": "Liverpool",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "2001-11-29",
      "City": "Los Angeles",
      "Region": "California",
      "Country": "United States"
    },
    "ActiveYears": [
      "1958–2001"
    ],
    "AssociatedActs": [
      "The Quarrymen",
      "The Beatles",
      "Traveling Wilburys",
      "Plastic Ono Band"
    ],
    "KeyAlbums": [
      {
        "Title": "All Things Must Pass",
        "Year": 1970,
        "Notes": "A landmark triple-album widely regarded as a peak post‑Beatles solo statement."
      },
      {
        "Title": "Living in the Material World",
        "Year": 1973,
        "Notes": "A major follow-up blending introspection with spiritual themes."
      },
      {
        "Title": "Cloud Nine",
        "Year": 1987,
        "Notes": "A late-career resurgence featuring polished pop-rock and renewed visibility."
      }
    ],
    "KeySongs": [
      "My Sweet Lord",
      "What Is Life",
      "Here Comes the Sun",
      "While My Guitar Gently Weeps",
      "Give Me Love (Give Me Peace on Earth)"
    ],
    "Achievements": [
      {
        "Type": "Rock & Roll Hall of Fame (solo)",
        "Year": 2004,
        "Detail": "Inducted posthumously as a solo performer."
      }
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.georgeharrison.com/",
      "AllMusic": "https://www.allmusic.com/artist/george-harrison-mn0000209142",
      "RockHall": "https://rockhall.com/inductees/george-harrison/",
      "Wikipedia": "https://en.wikipedia.org/wiki/George_Harrison",
      "Discogs": "https://www.discogs.com/artist/35323-George-Harrison"
    }
  },
  {
    "BioID": "ringo-starr__the-beatles",
    "ArtistID": "the-beatles",
    "ArtistName": "The Beatles",
    "MemberName": "Ringo Starr",
    "Biography": [
      "Ringo Starr (born Richard Starkey; born 7 July 1940) is the drummer of the Beatles, known for a steady, song‑first approach that became a defining part of the band’s sound.",
      "Raised in Liverpool, Starr developed his musical career in the city’s pre‑Beatles club circuit. In 1962 he replaced Pete Best as the Beatles’ drummer, completing the lineup that would become one of the most influential groups in popular music.",
      "Within the Beatles, Starr’s drumming emphasized feel, economy, and memorable parts that served each song’s narrative and arrangement. He also contributed vocals on several standout tracks and became a beloved public face of the band through film appearances and a distinctive, understated humor.",
      "After the Beatles split, Starr released solo records and remained active across music, film, and television. He was nominated for an Emmy in connection with the children’s television series Shining Time Station and later published books of photography that documented his life and career.",
      "In 1989 he formed the first Ringo Starr & His All‑Starr Band, a rotating touring ensemble that has continued across multiple lineups and eras. The project has allowed him to perform both Beatles staples and his solo work alongside notable collaborators.",
      "The Beatles were inducted into the Rock & Roll Hall of Fame in 1988. Starr was inducted as a solo performer in 2015 (Musical Excellence) and was knighted in 2018 for services to music."
    ],
    "Birth": {
      "Date": "1940-07-07",
      "City": "Liverpool",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "",
      "City": "",
      "Region": "",
      "Country": ""
    },
    "ActiveYears": [
      "1957–present"
    ],
    "AssociatedActs": [
      "Rory Storm & the Hurricanes",
      "The Beatles",
      "Plastic Ono Band",
      "Ringo Starr & His All-Starr Band"
    ],
    "KeyAlbums": [
      {
        "Title": "Ringo",
        "Year": 1973,
        "Notes": "A standout solo release featuring strong songwriting support and wide recognition."
      },
      {
        "Title": "Goodnight Vienna",
        "Year": 1974,
        "Notes": "A major mid‑70s follow‑up from his most commercially visible solo period."
      }
    ],
    "KeySongs": [
      "It Don’t Come Easy",
      "Photograph",
      "Back Off Boogaloo",
      "You’re Sixteen",
      "Octopus’s Garden"
    ],
    "Achievements": [
      {
        "Type": "Rock & Roll Hall of Fame (solo)",
        "Year": 2015,
        "Detail": "Inducted with the Musical Excellence award."
      }
    ],
    "ExternalLinks": {
      "OfficialSite": "https://www.ringostarr.com/",
      "AllMusic": "https://www.allmusic.com/artist/ringo-starr-mn0000217792",
      "RockHall": "https://rockhall.com/inductees/ringo-starr/",
      "Wikipedia": "https://en.wikipedia.org/wiki/Ringo_Starr",
      "Discogs": "https://www.discogs.com/artist/257527-Ringo-Starr"
    }
  },
  {
    "BioID": "alan-parsons__the-alan-parsons-project",
    "ArtistID": "the-alan-parsons-project",
    "ArtistName": "The Alan Parsons Project",
    "MemberName": "Alan Parsons",
    "Biography": [
      "Alan Parsons (born 20 December 1948) is an English audio engineer, producer, and musician whose career bridges the craft of studio recording and the creation of polished, concept‑driven rock albums.",
      "Parsons began working for EMI at a young age and trained in the Abbey Road Studios environment, developing technical skills during an era when the studio itself was becoming a creative instrument. His early work included engineering roles on major recordings for the Beatles, including Abbey Road and Let It Be.",
      "He later became closely associated with landmark progressive-rock production, serving as engineer on Pink Floyd’s The Dark Side of the Moon. The album’s sonic ambition and meticulous engineering became a reference point for rock production, and Parsons received major industry recognition connected to this work.",
      "In 1975 Parsons partnered with songwriter and concept‑builder Eric Woolfson to form the Alan Parsons Project, a studio‑centered act built around carefully constructed albums and a revolving cast of vocalists and session musicians. Their debut, Tales of Mystery and Imagination, launched a run of concept albums that combined progressive rock, pop, and orchestral textures.",
      "The Project scored significant international hits and enduring staples, including “Sirius” and “Eye in the Sky,” and albums such as I Robot and Eye in the Sky became cornerstones of late‑1970s/early‑1980s album‑oriented rock. The group’s work is frequently noted for its clarity, dynamics, and high-end studio finish.",
      "Across his career Parsons earned eight GRAMMY nominations in the Best Engineered Album, Non‑Classical category, with his first nomination tied to The Dark Side of the Moon. After the Project era, he continued releasing music under his own name and touring with band formats that brought the studio material to the stage while maintaining his reputation as a precision-minded producer."
    ],
    "Birth": {
      "Date": "1948-12-20",
      "City": "Willesden (London)",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "",
      "City": "",
      "Region": "",
      "Country": ""
    },
    "ActiveYears": [
      "1967–present"
    ],
    "AssociatedActs": [
      "The Alan Parsons Project"
    ],
    "KeyAlbums": [
      {
        "Title": "I Robot",
        "Year": 1977,
        "Notes": "A defining Project album noted for its concept, polish, and progressive-pop balance."
      },
      {
        "Title": "Eye in the Sky",
        "Year": 1982,
        "Notes": "A major commercial peak featuring one of the Project’s signature singles."
      }
    ],
    "KeySongs": [
      "Eye in the Sky",
      "Games People Play",
      "Time",
      "Don’t Answer Me"
    ],
    "Achievements": [
      {
        "Type": "Grammy nomination (engineering)",
        "Year": 1983,
        "Detail": "Eye in the Sky was nominated for Best Engineered Album at the 25th Grammy Awards."
      }
    ],
    "ExternalLinks": {
      "OfficialSite": "https://alanparsons.com/",
      "AllMusic": "https://www.allmusic.com/artist/alan-parsons-mn0000031274",
      "Wikipedia": "https://en.wikipedia.org/wiki/Alan_Parsons",
      "Discogs": "https://www.discogs.com/artist/10881-Alan-Parsons"
    }
  },
  {
    "BioID": "eric-woolfson__the-alan-parsons-project",
    "ArtistID": "the-alan-parsons-project",
    "ArtistName": "The Alan Parsons Project",
    "MemberName": "Eric Woolfson",
    "Biography": [
      "Eric Woolfson (18 March 1945 – 2 December 2009) was a Scottish songwriter, lyricist, vocalist, and producer who co-created the Alan Parsons Project and helped shape its identity as a concept‑album act built around strong hooks and narrative themes.",
      "Born in Glasgow, Woolfson built an early career in songwriting and music business roles before focusing on long‑form projects. His strengths lay in developing album concepts, writing lyrics and melodies, and shaping songs that could be delivered by different vocalists while remaining recognizably part of a coherent “Project” style.",
      "In the mid‑1970s Woolfson partnered with Alan Parsons, combining his writing and conceptual approach with Parsons’s studio expertise. Together they built the Alan Parsons Project as a revolving collective rather than a fixed touring band, using session musicians and multiple lead singers to match each song’s character.",
      "Woolfson co-wrote the Project’s best‑known material, including songs such as “Eye in the Sky,” and his guide vocals were often used in the development process even when other singers recorded the final releases. The Project’s albums blended progressive structures with pop accessibility, helping them reach a wide international audience.",
      "After the Project’s main run, Woolfson increasingly devoted his energy to musical theatre, creating and developing stage works including Freudiana and Gaudi, and continuing to expand the Edgar Allan Poe–inspired material that had launched the Project’s debut album. These productions reflected his interest in narrative songwriting and character-driven composition.",
      "Woolfson died of kidney cancer on 2 December 2009. His legacy is closely tied to the Alan Parsons Project’s catalog and to his later work translating rock songwriting techniques into theatrical forms."
    ],
    "Birth": {
      "Date": "1945-03-18",
      "City": "Glasgow",
      "Region": "Scotland",
      "Country": "United Kingdom"
    },
    "Death": {
      "Date": "2009-12-02",
      "City": "London",
      "Region": "England",
      "Country": "United Kingdom"
    },
    "ActiveYears": [
      "1960s–2009"
    ],
    "AssociatedActs": [
      "The Alan Parsons Project"
    ],
    "KeyAlbums": [
      {
        "Title": "Tales of Mystery and Imagination",
        "Year": 1976,
        "Notes": "The Project’s debut concept album, rooted in Edgar Allan Poe themes."
      },
      {
        "Title": "The Turn of a Friendly Card",
        "Year": 1980,
        "Notes": "A concept record blending progressive structure with pop-oriented songwriting."
      }
    ],
    "KeySongs": [
      "Time",
      "Don’t Answer Me",
      "Games People Play",
      "Old and Wise"
    ],
    "Achievements": [],
    "ExternalLinks": {
      "OfficialSite": "https://www.ericwoolfsonmusic.com/biography",
      "Wikipedia": "https://en.wikipedia.org/wiki/Eric_Woolfson",
      "Discogs": "https://www.discogs.com/artist/194052-Eric-Woolfson"
    }
  }
]